module attributes {llvm.data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", llvm.target_triple = "x86_64-unknown-linux-gnu"} {
  func.func @main_graph(%arg0: tensor<1x3x224x224xf32>) -> tensor<1x1000xf32> attributes {input_names = ["input"], output_names = ["output"]} {
    %0 = "onnx.NoValue"() {value} : () -> none
    %1 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %2 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %3 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %4 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %5 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %6 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %7 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x256x1x1xf32>} : () -> tensor<128x256x1x1xf32>
    %8 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %9 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %10 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %11 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %12 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %13 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %14 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %15 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %16 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %17 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %18 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %19 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %20 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<256x512x1x1xf32>} : () -> tensor<256x512x1x1xf32>
    %21 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %22 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %23 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %24 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %25 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %26 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %27 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %28 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %29 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %30 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %31 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %32 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %33 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %34 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %35 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %36 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %37 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %38 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %39 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %40 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %41 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %42 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %43 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %44 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %45 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<512x1024x1x1xf32>} : () -> tensor<512x1024x1x1xf32>
    %46 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %47 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %48 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %49 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %50 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %51 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %52 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %53 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %54 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %55 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %56 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %57 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %58 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %59 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %60 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %61 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<32x128x3x3xf32>} : () -> tensor<32x128x3x3xf32>
    %62 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1000x1024xf32>} : () -> tensor<1000x1024xf32>
    %63 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1000xf32>} : () -> tensor<1000xf32>
    %64 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<64x3x7x7xf32>} : () -> tensor<64x3x7x7xf32>
    %65 = "onnx.Constant"() {value = dense<[0.0954766721, 0.0401740782, 0.033964932, 0.0843562185, 0.0738225132, 0.0584377535, 0.0420899913, 0.0321952403, -1.3154272E-7, 0.0685673133, 0.0708844363, 0.065111354, 0.0414732546, 0.126315504, 0.171281472, -1.23873932E-7, 0.0414272696, 0.264912069, 0.193410859, 0.0379265584, 0.0430556126, 3.811160e-02, 0.0273683667, 0.198468149, 0.0345053151, 0.148404583, 0.104761675, 0.03779893, 0.0488879643, 0.0469693914, -8.367990e-02, 0.213000774, 0.17426151, 0.124230318, 0.0893096923, 0.0310361926, 0.0257440303, 0.0330256633, 0.195432693, 0.0289952774, 0.0334751047, 0.194670483, 0.132353663, 0.0392723866, 0.0744598955, 0.0586149059, 0.0374237932, 0.127922177, 0.0673577264, 0.0586432777, 0.0448888838, 0.0593128242, 0.0315713212, 0.0470822789, 0.0313891135, 0.12965776, 0.0372733399, 0.0563362613, 0.0420354083, 0.123085685, 0.0318712816, 3.147260e-02, 0.0385076851, 0.183189109]> : tensor<64xf32>} : () -> tensor<64xf32>
    %66 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x64x1x1xf32>} : () -> tensor<128x64x1x1xf32>
    %67 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x96x1x1xf32>} : () -> tensor<128x96x1x1xf32>
    %68 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x128x1x1xf32>} : () -> tensor<128x128x1x1xf32>
    %69 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x160x1x1xf32>} : () -> tensor<128x160x1x1xf32>
    %70 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x192x1x1xf32>} : () -> tensor<128x192x1x1xf32>
    %71 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x224x1x1xf32>} : () -> tensor<128x224x1x1xf32>
    %72 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x128x1x1xf32>} : () -> tensor<128x128x1x1xf32>
    %73 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x160x1x1xf32>} : () -> tensor<128x160x1x1xf32>
    %74 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x192x1x1xf32>} : () -> tensor<128x192x1x1xf32>
    %75 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x224x1x1xf32>} : () -> tensor<128x224x1x1xf32>
    %76 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x256x1x1xf32>} : () -> tensor<128x256x1x1xf32>
    %77 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x288x1x1xf32>} : () -> tensor<128x288x1x1xf32>
    %78 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x320x1x1xf32>} : () -> tensor<128x320x1x1xf32>
    %79 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x352x1x1xf32>} : () -> tensor<128x352x1x1xf32>
    %80 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x384x1x1xf32>} : () -> tensor<128x384x1x1xf32>
    %81 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x416x1x1xf32>} : () -> tensor<128x416x1x1xf32>
    %82 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x448x1x1xf32>} : () -> tensor<128x448x1x1xf32>
    %83 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x480x1x1xf32>} : () -> tensor<128x480x1x1xf32>
    %84 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x256x1x1xf32>} : () -> tensor<128x256x1x1xf32>
    %85 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x288x1x1xf32>} : () -> tensor<128x288x1x1xf32>
    %86 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x320x1x1xf32>} : () -> tensor<128x320x1x1xf32>
    %87 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x352x1x1xf32>} : () -> tensor<128x352x1x1xf32>
    %88 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x384x1x1xf32>} : () -> tensor<128x384x1x1xf32>
    %89 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x416x1x1xf32>} : () -> tensor<128x416x1x1xf32>
    %90 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x448x1x1xf32>} : () -> tensor<128x448x1x1xf32>
    %91 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x480x1x1xf32>} : () -> tensor<128x480x1x1xf32>
    %92 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x512x1x1xf32>} : () -> tensor<128x512x1x1xf32>
    %93 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x544x1x1xf32>} : () -> tensor<128x544x1x1xf32>
    %94 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x576x1x1xf32>} : () -> tensor<128x576x1x1xf32>
    %95 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x608x1x1xf32>} : () -> tensor<128x608x1x1xf32>
    %96 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x640x1x1xf32>} : () -> tensor<128x640x1x1xf32>
    %97 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x672x1x1xf32>} : () -> tensor<128x672x1x1xf32>
    %98 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x704x1x1xf32>} : () -> tensor<128x704x1x1xf32>
    %99 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x736x1x1xf32>} : () -> tensor<128x736x1x1xf32>
    %100 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x768x1x1xf32>} : () -> tensor<128x768x1x1xf32>
    %101 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x800x1x1xf32>} : () -> tensor<128x800x1x1xf32>
    %102 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x832x1x1xf32>} : () -> tensor<128x832x1x1xf32>
    %103 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x864x1x1xf32>} : () -> tensor<128x864x1x1xf32>
    %104 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x896x1x1xf32>} : () -> tensor<128x896x1x1xf32>
    %105 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x928x1x1xf32>} : () -> tensor<128x928x1x1xf32>
    %106 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x960x1x1xf32>} : () -> tensor<128x960x1x1xf32>
    %107 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x992x1x1xf32>} : () -> tensor<128x992x1x1xf32>
    %108 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x512x1x1xf32>} : () -> tensor<128x512x1x1xf32>
    %109 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x544x1x1xf32>} : () -> tensor<128x544x1x1xf32>
    %110 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x576x1x1xf32>} : () -> tensor<128x576x1x1xf32>
    %111 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x608x1x1xf32>} : () -> tensor<128x608x1x1xf32>
    %112 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x640x1x1xf32>} : () -> tensor<128x640x1x1xf32>
    %113 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x672x1x1xf32>} : () -> tensor<128x672x1x1xf32>
    %114 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x704x1x1xf32>} : () -> tensor<128x704x1x1xf32>
    %115 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x736x1x1xf32>} : () -> tensor<128x736x1x1xf32>
    %116 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x768x1x1xf32>} : () -> tensor<128x768x1x1xf32>
    %117 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x800x1x1xf32>} : () -> tensor<128x800x1x1xf32>
    %118 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x832x1x1xf32>} : () -> tensor<128x832x1x1xf32>
    %119 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x864x1x1xf32>} : () -> tensor<128x864x1x1xf32>
    %120 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x896x1x1xf32>} : () -> tensor<128x896x1x1xf32>
    %121 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x928x1x1xf32>} : () -> tensor<128x928x1x1xf32>
    %122 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x960x1x1xf32>} : () -> tensor<128x960x1x1xf32>
    %123 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x992x1x1xf32>} : () -> tensor<128x992x1x1xf32>
    %124 = "onnx.Conv"(%arg0, %64, %65) {auto_pad = "NOTSET", dilations = [1, 1], group = 1 : si64, kernel_shape = [7, 7], onnx_node_name = "Conv_0", pads = [3, 3, 3, 3], strides = [2, 2]} : (tensor<1x3x224x224xf32>, tensor<64x3x7x7xf32>, tensor<64xf32>) -> tensor<1x64x112x112xf32>
    %125 = "onnx.Relu"(%124) {onnx_node_name = "Relu_1"} : (tensor<1x64x112x112xf32>) -> tensor<1x64x112x112xf32>
    %126 = "onnx.MaxPoolSingleOut"(%125) {auto_pad = "NOTSET", ceil_mode = 0 : si64, kernel_shape = [3, 3], onnx_node_name = "MaxPool_2", pads = [1, 1, 1, 1], storage_order = 0 : si64, strides = [2, 2]} : (tensor<1x64x112x112xf32>) -> tensor<1x64x56x56xf32>
    %127 = "onnx.Concat"(%126) {axis = 1 : si64, onnx_node_name = "Concat_3"} : (tensor<1x64x56x56xf32>) -> tensor<1x64x56x56xf32>
    %128 = "onnx.Constant"() {value = dense<[[[11.6892796]], [[4.53634501]], [[7.39521074]], [[7.27564812]], [[4.64358711]], [[6.19684076]], [[2.59986864E-5]], [[7.22274208]], [[3.55926786E-5]], [[7.83067798]], [[8.51364803]], [[1.14596939]], [[4.5394721]], [[0.683662415]], [[1.06889069]], [[8.00976864E-7]], [[7.43943262]], [[4.70958952E-8]], [[5.15714073]], [[8.90024471]], [[8.11454296]], [[8.17086124]], [[8.19720554]], [[7.490830e-09]], [[3.92417299E-8]], [[1.46890759]], [[5.53578779E-4]], [[9.05536746]], [[7.51300478]], [[6.1017909]], [[2.12097549]], [[2.35289352E-8]], [[3.13935189E-9]], [[0.809074521]], [[9.84169387]], [[4.42619324]], [[9.96486663]], [[8.85020542]], [[0.733466744]], [[9.68193531]], [[7.36616898]], [[2.6238407E-4]], [[0.94071865]], [[6.42675781]], [[1.13998735]], [[8.32621288]], [[8.21137142]], [[1.83713293]], [[9.228520e+00]], [[8.74590206]], [[3.0766356]], [[4.39045763]], [[7.71397352]], [[8.34531402]], [[8.15929698]], [[1.50924993]], [[9.36340236]], [[4.40537214]], [[8.51048564]], [[0.594300687]], [[9.62524318]], [[9.71533107]], [[7.80308199]], [[7.950860e-01]]]> : tensor<64x1x1xf32>} : () -> tensor<64x1x1xf32>
    %129 = "onnx.Mul"(%127, %128) : (tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) -> tensor<1x64x56x56xf32>
    %130 = "onnx.Constant"() {value = dense<[[[-1.0485841]], [[-8.539570e-02]], [[-1.517960e-01]], [[-0.210508525]], [[-0.279511511]], [[-2.627010e-01]], [[-5.21759503E-5]], [[-0.116886944]], [[-6.7788541E-8]], [[-0.126144499]], [[-0.517272174]], [[-0.0365305021]], [[-0.172658056]], [[-0.0242010597]], [[-0.0120957075]], [[-1.55661795E-8]], [[-0.514289081]], [[-1.59553949E-7]], [[-1.11478233]], [[-0.218560904]], [[-0.212965906]], [[-0.183855027]], [[-0.166788474]], [[-5.37303713E-8]], [[-3.02389616E-8]], [[-0.0833927989]], [[-0.00116034178]], [[-0.219891548]], [[-0.213314205]], [[-0.305463672]], [[-3.209060e-01]], [[-7.13725469E-8]], [[-7.9037985E-9]], [[-0.120528862]], [[-0.820684731]], [[-0.103146568]], [[-0.160768703]], [[-0.173888505]], [[-0.0145310117]], [[-0.171164542]], [[-0.130512714]], [[-0.00111440662]], [[-0.303956747]], [[-0.15334785]], [[0.0039090761]], [[-0.230128318]], [[-0.192852795]], [[-0.171310008]], [[-0.436436146]], [[-0.131603852]], [[-0.215577364]], [[-0.277962983]], [[-0.168633536]], [[-0.26301676]], [[-0.144895345]], [[-0.112316526]], [[-0.223576695]], [[-0.231791869]], [[-0.272347659]], [[-0.0485988148]], [[-0.183140814]], [[-0.188633934]], [[-0.148012251]], [[-0.235206172]]]> : tensor<64x1x1xf32>} : () -> tensor<64x1x1xf32>
    %131 = "onnx.Add"(%129, %130) : (tensor<1x64x56x56xf32>, tensor<64x1x1xf32>) -> tensor<1x64x56x56xf32>
    %132 = "onnx.Relu"(%131) {onnx_node_name = "Relu_5"} : (tensor<1x64x56x56xf32>) -> tensor<1x64x56x56xf32>
    %133 = "onnx.Dim"(%132) {axis = 0 : si64} : (tensor<1x64x56x56xf32>) -> tensor<1xi64>
    %134 = "onnx.Constant"() {value = dense<64> : tensor<1xi64>} : () -> tensor<1xi64>
    %135 = "onnx.Constant"() {value = dense<-1> : tensor<1xi64>} : () -> tensor<1xi64>
    %136 = "onnx.Concat"(%133, %134, %135) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<3xi64>
    %137 = "onnx.Reshape"(%132, %136) {allowzero = 0 : si64} : (tensor<1x64x56x56xf32>, tensor<3xi64>) -> tensor<1x64x?xf32>
    %138 = "onnx.Constant"() {value = dense<[128, -1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %139 = "onnx.Reshape"(%66, %138) {allowzero = 0 : si64} : (tensor<128x64x1x1xf32>, tensor<2xi64>) -> tensor<128x64xf32>
    %140 = "onnx.MatMul"(%139, %137) : (tensor<128x64xf32>, tensor<1x64x?xf32>) -> tensor<1x128x?xf32>
    %141 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x128x1xf32>} : () -> tensor<1x128x1xf32>
    %142 = "onnx.Add"(%140, %141) : (tensor<1x128x?xf32>, tensor<1x128x1xf32>) -> tensor<1x128x?xf32>
    %143 = "onnx.Dim"(%132) {axis = 0 : si64} : (tensor<1x64x56x56xf32>) -> tensor<1xi64>
    %144 = "onnx.Constant"() {value = dense<56> : tensor<1xi64>} : () -> tensor<1xi64>
    %145 = "onnx.Constant"() {value = dense<56> : tensor<1xi64>} : () -> tensor<1xi64>
    %146 = "onnx.Constant"() {value = dense<128> : tensor<1xi64>} : () -> tensor<1xi64>
    %147 = "onnx.Concat"(%143, %146, %144, %145) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<4xi64>
    %148 = "onnx.Reshape"(%142, %147) {allowzero = 0 : si64} : (tensor<1x128x?xf32>, tensor<4xi64>) -> tensor<1x128x56x56xf32>
    %149 = "onnx.Relu"(%148) {onnx_node_name = "Relu_7"} : (tensor<1x128x56x56xf32>) -> tensor<1x128x56x56xf32>
    %150 = "onnx.Conv"(%149, %1, %0) {auto_pad = "NOTSET", dilations = [1, 1], group = 1 : si64, kernel_shape = [3, 3], onnx_node_name = "Conv_8", pads = [1, 1, 1, 1], strides = [1, 1]} : (tensor<1x128x56x56xf32>, tensor<32x128x3x3xf32>, none) -> tensor<1x32x56x56xf32>
    %151 = "onnx.Concat"(%126, %150) {axis = 1 : si64, onnx_node_name = "Concat_9"} : (tensor<1x64x56x56xf32>, tensor<1x32x56x56xf32>) -> tensor<1x96x56x56xf32>
    %152 = "onnx.Constant"() {value = dense<[[[6.46187686]], [[8.76598358]], [[2.55633068]], [[6.34727335]], [[1.75716329]], [[1.92042458]], [[1.20291018]], [[7.50253963]], [[1.8410874E-5]], [[5.34487057]], [[2.92041516]], [[0.969825565]], [[9.215220e+00]], [[0.961667895]], [[2.66503692]], [[9.77311719E-6]], [[7.40338039]], [[-1.47218668]], [[0.679185569]], [[4.61254692]], [[6.60908603]], [[8.21489715]], [[8.0283165]], [[-1.20490861]], [[10.867486]], [[1.5101763]], [[0.774183273]], [[4.38203049]], [[6.23299742]], [[8.91781902]], [[1.28825271]], [[1.20281363]], [[2.55104256]], [[-2.02764773]], [[4.4696722]], [[8.3797121]], [[6.13494968]], [[6.4294529]], [[0.405762345]], [[6.75588274]], [[8.29045772]], [[0.41028583]], [[-2.57729459]], [[8.17056656]], [[0.97791934]], [[8.65771198]], [[7.03511477]], [[4.21845245]], [[4.32091665]], [[5.00695229]], [[2.9397893]], [[10.5395517]], [[8.50381088]], [[4.72403336]], [[6.84033632]], [[-4.55388165]], [[5.62064028]], [[10.4773092]], [[4.24561262]], [[1.46742558]], [[6.59477091]], [[4.76936722]], [[6.08412123]], [[0.818724036]], [[0.519533277]], [[1.05055976]], [[0.720307826]], [[0.931162596]], [[1.08799851]], [[5.739850e-01]], [[1.10581362]], [[0.430791378]], [[0.419466823]], [[0.519306302]], [[0.502445877]], [[0.763017594]], [[0.548114657]], [[0.345668018]], [[0.554474771]], [[1.1978029]], [[1.04198718]], [[0.436703384]], [[0.604393899]], [[0.474091291]], [[1.16075182]], [[0.804222822]], [[1.02960062]], [[0.79319328]], [[0.523637772]], [[0.423219949]], [[0.791175365]], [[0.865986764]], [[0.476929277]], [[1.37596238]], [[0.54526037]], [[0.476053417]]]> : tensor<96x1x1xf32>} : () -> tensor<96x1x1xf32>
    %153 = "onnx.Mul"(%151, %152) : (tensor<1x96x56x56xf32>, tensor<96x1x1xf32>) -> tensor<1x96x56x56xf32>
    %154 = "onnx.Constant"() {value = dense<[[[-0.595897138]], [[-0.199460909]], [[-0.090461336]], [[-0.292226404]], [[-0.140789866]], [[-0.108072698]], [[-0.169308051]], [[-0.15318574]], [[1.39468757E-8]], [[-0.395378768]], [[-0.185095236]], [[-0.107703544]], [[-0.248739421]], [[-0.13657403]], [[-0.146974921]], [[-3.60013885E-8]], [[-0.126971751]], [[0.369037598]], [[-0.130006328]], [[-0.1314518]], [[-0.220807537]], [[-0.254927337]], [[-0.134888887]], [[0.239716277]], [[-0.279142439]], [[-0.174768418]], [[-0.0163080376]], [[-0.155355722]], [[-0.198194861]], [[-0.260576695]], [[-0.219986737]], [[-0.168376222]], [[-0.31210652]], [[0.68238306]], [[-0.351031154]], [[-0.136824116]], [[-0.13647677]], [[-0.15810819]], [[-0.0533176139]], [[-1.471270e-01]], [[-0.194079816]], [[-0.189336896]], [[0.855149328]], [[-0.268835396]], [[-0.10248071]], [[-0.329984367]], [[-0.182476297]], [[-0.385051787]], [[-0.274500698]], [[-0.198960304]], [[-6.771880e-02]], [[-0.416073292]], [[-0.212256953]], [[-0.19077611]], [[-0.14473936]], [[1.05878127]], [[-0.180195287]], [[-0.394159675]], [[-1.366470e-01]], [[-0.0675908923]], [[-0.164278328]], [[-0.143147156]], [[-0.157926574]], [[-0.190741882]], [[0.529187083]], [[0.0739547312]], [[0.0891401842]], [[-0.0326570794]], [[0.377718031]], [[-0.0672008321]], [[-0.040206816]], [[-5.506890e-02]], [[-0.0837010368]], [[-0.0623854584]], [[0.191766232]], [[0.515365422]], [[-0.0526901633]], [[-0.023295721]], [[0.0391182899]], [[-0.0111500993]], [[-0.300890326]], [[0.0159648862]], [[0.524944901]], [[0.116763286]], [[-0.331817478]], [[0.637087762]], [[0.721311092]], [[0.0349656977]], [[-0.100316934]], [[-0.0372446179]], [[0.142288029]], [[0.288051605]], [[-0.0996354445]], [[1.01566529]], [[-0.0397267081]], [[-0.0245948806]]]> : tensor<96x1x1xf32>} : () -> tensor<96x1x1xf32>
    %155 = "onnx.Add"(%153, %154) : (tensor<1x96x56x56xf32>, tensor<96x1x1xf32>) -> tensor<1x96x56x56xf32>
    %156 = "onnx.Relu"(%155) {onnx_node_name = "Relu_11"} : (tensor<1x96x56x56xf32>) -> tensor<1x96x56x56xf32>
    %157 = "onnx.Dim"(%156) {axis = 0 : si64} : (tensor<1x96x56x56xf32>) -> tensor<1xi64>
    %158 = "onnx.Constant"() {value = dense<96> : tensor<1xi64>} : () -> tensor<1xi64>
    %159 = "onnx.Constant"() {value = dense<-1> : tensor<1xi64>} : () -> tensor<1xi64>
    %160 = "onnx.Concat"(%157, %158, %159) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<3xi64>
    %161 = "onnx.Reshape"(%156, %160) {allowzero = 0 : si64} : (tensor<1x96x56x56xf32>, tensor<3xi64>) -> tensor<1x96x?xf32>
    %162 = "onnx.Constant"() {value = dense<[128, -1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %163 = "onnx.Reshape"(%67, %162) {allowzero = 0 : si64} : (tensor<128x96x1x1xf32>, tensor<2xi64>) -> tensor<128x96xf32>
    %164 = "onnx.MatMul"(%163, %161) : (tensor<128x96xf32>, tensor<1x96x?xf32>) -> tensor<1x128x?xf32>
    %165 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x128x1xf32>} : () -> tensor<1x128x1xf32>
    %166 = "onnx.Add"(%164, %165) : (tensor<1x128x?xf32>, tensor<1x128x1xf32>) -> tensor<1x128x?xf32>
    %167 = "onnx.Dim"(%156) {axis = 0 : si64} : (tensor<1x96x56x56xf32>) -> tensor<1xi64>
    %168 = "onnx.Constant"() {value = dense<56> : tensor<1xi64>} : () -> tensor<1xi64>
    %169 = "onnx.Constant"() {value = dense<56> : tensor<1xi64>} : () -> tensor<1xi64>
    %170 = "onnx.Constant"() {value = dense<128> : tensor<1xi64>} : () -> tensor<1xi64>
    %171 = "onnx.Concat"(%167, %170, %168, %169) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<4xi64>
    %172 = "onnx.Reshape"(%166, %171) {allowzero = 0 : si64} : (tensor<1x128x?xf32>, tensor<4xi64>) -> tensor<1x128x56x56xf32>
    %173 = "onnx.Relu"(%172) {onnx_node_name = "Relu_13"} : (tensor<1x128x56x56xf32>) -> tensor<1x128x56x56xf32>
    %174 = "onnx.Conv"(%173, %2, %0) {auto_pad = "NOTSET", dilations = [1, 1], group = 1 : si64, kernel_shape = [3, 3], onnx_node_name = "Conv_14", pads = [1, 1, 1, 1], strides = [1, 1]} : (tensor<1x128x56x56xf32>, tensor<32x128x3x3xf32>, none) -> tensor<1x32x56x56xf32>
    %175 = "onnx.Concat"(%126, %150, %174) {axis = 1 : si64, onnx_node_name = "Concat_15"} : (tensor<1x64x56x56xf32>, tensor<1x32x56x56xf32>, tensor<1x32x56x56xf32>) -> tensor<1x128x56x56xf32>
    %176 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x1x1xf32>} : () -> tensor<128x1x1xf32>
    %177 = "onnx.Mul"(%175, %176) : (tensor<1x128x56x56xf32>, tensor<128x1x1xf32>) -> tensor<1x128x56x56xf32>
    %178 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x1x1xf32>} : () -> tensor<128x1x1xf32>
    %179 = "onnx.Add"(%177, %178) : (tensor<1x128x56x56xf32>, tensor<128x1x1xf32>) -> tensor<1x128x56x56xf32>
    %180 = "onnx.Relu"(%179) {onnx_node_name = "Relu_17"} : (tensor<1x128x56x56xf32>) -> tensor<1x128x56x56xf32>
    %181 = "onnx.Dim"(%180) {axis = 0 : si64} : (tensor<1x128x56x56xf32>) -> tensor<1xi64>
    %182 = "onnx.Constant"() {value = dense<128> : tensor<1xi64>} : () -> tensor<1xi64>
    %183 = "onnx.Constant"() {value = dense<-1> : tensor<1xi64>} : () -> tensor<1xi64>
    %184 = "onnx.Concat"(%181, %182, %183) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<3xi64>
    %185 = "onnx.Reshape"(%180, %184) {allowzero = 0 : si64} : (tensor<1x128x56x56xf32>, tensor<3xi64>) -> tensor<1x128x?xf32>
    %186 = "onnx.Constant"() {value = dense<[128, -1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %187 = "onnx.Reshape"(%68, %186) {allowzero = 0 : si64} : (tensor<128x128x1x1xf32>, tensor<2xi64>) -> tensor<128x128xf32>
    %188 = "onnx.MatMul"(%187, %185) : (tensor<128x128xf32>, tensor<1x128x?xf32>) -> tensor<1x128x?xf32>
    %189 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x128x1xf32>} : () -> tensor<1x128x1xf32>
    %190 = "onnx.Add"(%188, %189) : (tensor<1x128x?xf32>, tensor<1x128x1xf32>) -> tensor<1x128x?xf32>
    %191 = "onnx.Dim"(%180) {axis = 0 : si64} : (tensor<1x128x56x56xf32>) -> tensor<1xi64>
    %192 = "onnx.Constant"() {value = dense<56> : tensor<1xi64>} : () -> tensor<1xi64>
    %193 = "onnx.Constant"() {value = dense<56> : tensor<1xi64>} : () -> tensor<1xi64>
    %194 = "onnx.Constant"() {value = dense<128> : tensor<1xi64>} : () -> tensor<1xi64>
    %195 = "onnx.Concat"(%191, %194, %192, %193) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<4xi64>
    %196 = "onnx.Reshape"(%190, %195) {allowzero = 0 : si64} : (tensor<1x128x?xf32>, tensor<4xi64>) -> tensor<1x128x56x56xf32>
    %197 = "onnx.Relu"(%196) {onnx_node_name = "Relu_19"} : (tensor<1x128x56x56xf32>) -> tensor<1x128x56x56xf32>
    %198 = "onnx.Conv"(%197, %3, %0) {auto_pad = "NOTSET", dilations = [1, 1], group = 1 : si64, kernel_shape = [3, 3], onnx_node_name = "Conv_20", pads = [1, 1, 1, 1], strides = [1, 1]} : (tensor<1x128x56x56xf32>, tensor<32x128x3x3xf32>, none) -> tensor<1x32x56x56xf32>
    %199 = "onnx.Concat"(%126, %150, %174, %198) {axis = 1 : si64, onnx_node_name = "Concat_21"} : (tensor<1x64x56x56xf32>, tensor<1x32x56x56xf32>, tensor<1x32x56x56xf32>, tensor<1x32x56x56xf32>) -> tensor<1x160x56x56xf32>
    %200 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<160x1x1xf32>} : () -> tensor<160x1x1xf32>
    %201 = "onnx.Mul"(%199, %200) : (tensor<1x160x56x56xf32>, tensor<160x1x1xf32>) -> tensor<1x160x56x56xf32>
    %202 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<160x1x1xf32>} : () -> tensor<160x1x1xf32>
    %203 = "onnx.Add"(%201, %202) : (tensor<1x160x56x56xf32>, tensor<160x1x1xf32>) -> tensor<1x160x56x56xf32>
    %204 = "onnx.Relu"(%203) {onnx_node_name = "Relu_23"} : (tensor<1x160x56x56xf32>) -> tensor<1x160x56x56xf32>
    %205 = "onnx.Dim"(%204) {axis = 0 : si64} : (tensor<1x160x56x56xf32>) -> tensor<1xi64>
    %206 = "onnx.Constant"() {value = dense<160> : tensor<1xi64>} : () -> tensor<1xi64>
    %207 = "onnx.Constant"() {value = dense<-1> : tensor<1xi64>} : () -> tensor<1xi64>
    %208 = "onnx.Concat"(%205, %206, %207) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<3xi64>
    %209 = "onnx.Reshape"(%204, %208) {allowzero = 0 : si64} : (tensor<1x160x56x56xf32>, tensor<3xi64>) -> tensor<1x160x?xf32>
    %210 = "onnx.Constant"() {value = dense<[128, -1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %211 = "onnx.Reshape"(%69, %210) {allowzero = 0 : si64} : (tensor<128x160x1x1xf32>, tensor<2xi64>) -> tensor<128x160xf32>
    %212 = "onnx.MatMul"(%211, %209) : (tensor<128x160xf32>, tensor<1x160x?xf32>) -> tensor<1x128x?xf32>
    %213 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x128x1xf32>} : () -> tensor<1x128x1xf32>
    %214 = "onnx.Add"(%212, %213) : (tensor<1x128x?xf32>, tensor<1x128x1xf32>) -> tensor<1x128x?xf32>
    %215 = "onnx.Dim"(%204) {axis = 0 : si64} : (tensor<1x160x56x56xf32>) -> tensor<1xi64>
    %216 = "onnx.Constant"() {value = dense<56> : tensor<1xi64>} : () -> tensor<1xi64>
    %217 = "onnx.Constant"() {value = dense<56> : tensor<1xi64>} : () -> tensor<1xi64>
    %218 = "onnx.Constant"() {value = dense<128> : tensor<1xi64>} : () -> tensor<1xi64>
    %219 = "onnx.Concat"(%215, %218, %216, %217) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<4xi64>
    %220 = "onnx.Reshape"(%214, %219) {allowzero = 0 : si64} : (tensor<1x128x?xf32>, tensor<4xi64>) -> tensor<1x128x56x56xf32>
    %221 = "onnx.Relu"(%220) {onnx_node_name = "Relu_25"} : (tensor<1x128x56x56xf32>) -> tensor<1x128x56x56xf32>
    %222 = "onnx.Conv"(%221, %4, %0) {auto_pad = "NOTSET", dilations = [1, 1], group = 1 : si64, kernel_shape = [3, 3], onnx_node_name = "Conv_26", pads = [1, 1, 1, 1], strides = [1, 1]} : (tensor<1x128x56x56xf32>, tensor<32x128x3x3xf32>, none) -> tensor<1x32x56x56xf32>
    %223 = "onnx.Concat"(%126, %150, %174, %198, %222) {axis = 1 : si64, onnx_node_name = "Concat_27"} : (tensor<1x64x56x56xf32>, tensor<1x32x56x56xf32>, tensor<1x32x56x56xf32>, tensor<1x32x56x56xf32>, tensor<1x32x56x56xf32>) -> tensor<1x192x56x56xf32>
    %224 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<192x1x1xf32>} : () -> tensor<192x1x1xf32>
    %225 = "onnx.Mul"(%223, %224) : (tensor<1x192x56x56xf32>, tensor<192x1x1xf32>) -> tensor<1x192x56x56xf32>
    %226 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<192x1x1xf32>} : () -> tensor<192x1x1xf32>
    %227 = "onnx.Add"(%225, %226) : (tensor<1x192x56x56xf32>, tensor<192x1x1xf32>) -> tensor<1x192x56x56xf32>
    %228 = "onnx.Relu"(%227) {onnx_node_name = "Relu_29"} : (tensor<1x192x56x56xf32>) -> tensor<1x192x56x56xf32>
    %229 = "onnx.Dim"(%228) {axis = 0 : si64} : (tensor<1x192x56x56xf32>) -> tensor<1xi64>
    %230 = "onnx.Constant"() {value = dense<192> : tensor<1xi64>} : () -> tensor<1xi64>
    %231 = "onnx.Constant"() {value = dense<-1> : tensor<1xi64>} : () -> tensor<1xi64>
    %232 = "onnx.Concat"(%229, %230, %231) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<3xi64>
    %233 = "onnx.Reshape"(%228, %232) {allowzero = 0 : si64} : (tensor<1x192x56x56xf32>, tensor<3xi64>) -> tensor<1x192x?xf32>
    %234 = "onnx.Constant"() {value = dense<[128, -1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %235 = "onnx.Reshape"(%70, %234) {allowzero = 0 : si64} : (tensor<128x192x1x1xf32>, tensor<2xi64>) -> tensor<128x192xf32>
    %236 = "onnx.MatMul"(%235, %233) : (tensor<128x192xf32>, tensor<1x192x?xf32>) -> tensor<1x128x?xf32>
    %237 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x128x1xf32>} : () -> tensor<1x128x1xf32>
    %238 = "onnx.Add"(%236, %237) : (tensor<1x128x?xf32>, tensor<1x128x1xf32>) -> tensor<1x128x?xf32>
    %239 = "onnx.Dim"(%228) {axis = 0 : si64} : (tensor<1x192x56x56xf32>) -> tensor<1xi64>
    %240 = "onnx.Constant"() {value = dense<56> : tensor<1xi64>} : () -> tensor<1xi64>
    %241 = "onnx.Constant"() {value = dense<56> : tensor<1xi64>} : () -> tensor<1xi64>
    %242 = "onnx.Constant"() {value = dense<128> : tensor<1xi64>} : () -> tensor<1xi64>
    %243 = "onnx.Concat"(%239, %242, %240, %241) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<4xi64>
    %244 = "onnx.Reshape"(%238, %243) {allowzero = 0 : si64} : (tensor<1x128x?xf32>, tensor<4xi64>) -> tensor<1x128x56x56xf32>
    %245 = "onnx.Relu"(%244) {onnx_node_name = "Relu_31"} : (tensor<1x128x56x56xf32>) -> tensor<1x128x56x56xf32>
    %246 = "onnx.Conv"(%245, %5, %0) {auto_pad = "NOTSET", dilations = [1, 1], group = 1 : si64, kernel_shape = [3, 3], onnx_node_name = "Conv_32", pads = [1, 1, 1, 1], strides = [1, 1]} : (tensor<1x128x56x56xf32>, tensor<32x128x3x3xf32>, none) -> tensor<1x32x56x56xf32>
    %247 = "onnx.Concat"(%126, %150, %174, %198, %222, %246) {axis = 1 : si64, onnx_node_name = "Concat_33"} : (tensor<1x64x56x56xf32>, tensor<1x32x56x56xf32>, tensor<1x32x56x56xf32>, tensor<1x32x56x56xf32>, tensor<1x32x56x56xf32>, tensor<1x32x56x56xf32>) -> tensor<1x224x56x56xf32>
    %248 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<224x1x1xf32>} : () -> tensor<224x1x1xf32>
    %249 = "onnx.Mul"(%247, %248) : (tensor<1x224x56x56xf32>, tensor<224x1x1xf32>) -> tensor<1x224x56x56xf32>
    %250 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<224x1x1xf32>} : () -> tensor<224x1x1xf32>
    %251 = "onnx.Add"(%249, %250) : (tensor<1x224x56x56xf32>, tensor<224x1x1xf32>) -> tensor<1x224x56x56xf32>
    %252 = "onnx.Relu"(%251) {onnx_node_name = "Relu_35"} : (tensor<1x224x56x56xf32>) -> tensor<1x224x56x56xf32>
    %253 = "onnx.Dim"(%252) {axis = 0 : si64} : (tensor<1x224x56x56xf32>) -> tensor<1xi64>
    %254 = "onnx.Constant"() {value = dense<224> : tensor<1xi64>} : () -> tensor<1xi64>
    %255 = "onnx.Constant"() {value = dense<-1> : tensor<1xi64>} : () -> tensor<1xi64>
    %256 = "onnx.Concat"(%253, %254, %255) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<3xi64>
    %257 = "onnx.Reshape"(%252, %256) {allowzero = 0 : si64} : (tensor<1x224x56x56xf32>, tensor<3xi64>) -> tensor<1x224x?xf32>
    %258 = "onnx.Constant"() {value = dense<[128, -1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %259 = "onnx.Reshape"(%71, %258) {allowzero = 0 : si64} : (tensor<128x224x1x1xf32>, tensor<2xi64>) -> tensor<128x224xf32>
    %260 = "onnx.MatMul"(%259, %257) : (tensor<128x224xf32>, tensor<1x224x?xf32>) -> tensor<1x128x?xf32>
    %261 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x128x1xf32>} : () -> tensor<1x128x1xf32>
    %262 = "onnx.Add"(%260, %261) : (tensor<1x128x?xf32>, tensor<1x128x1xf32>) -> tensor<1x128x?xf32>
    %263 = "onnx.Dim"(%252) {axis = 0 : si64} : (tensor<1x224x56x56xf32>) -> tensor<1xi64>
    %264 = "onnx.Constant"() {value = dense<56> : tensor<1xi64>} : () -> tensor<1xi64>
    %265 = "onnx.Constant"() {value = dense<56> : tensor<1xi64>} : () -> tensor<1xi64>
    %266 = "onnx.Constant"() {value = dense<128> : tensor<1xi64>} : () -> tensor<1xi64>
    %267 = "onnx.Concat"(%263, %266, %264, %265) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<4xi64>
    %268 = "onnx.Reshape"(%262, %267) {allowzero = 0 : si64} : (tensor<1x128x?xf32>, tensor<4xi64>) -> tensor<1x128x56x56xf32>
    %269 = "onnx.Relu"(%268) {onnx_node_name = "Relu_37"} : (tensor<1x128x56x56xf32>) -> tensor<1x128x56x56xf32>
    %270 = "onnx.Conv"(%269, %6, %0) {auto_pad = "NOTSET", dilations = [1, 1], group = 1 : si64, kernel_shape = [3, 3], onnx_node_name = "Conv_38", pads = [1, 1, 1, 1], strides = [1, 1]} : (tensor<1x128x56x56xf32>, tensor<32x128x3x3xf32>, none) -> tensor<1x32x56x56xf32>
    %271 = "onnx.Concat"(%126, %150, %174, %198, %222, %246, %270) {axis = 1 : si64, onnx_node_name = "Concat_39"} : (tensor<1x64x56x56xf32>, tensor<1x32x56x56xf32>, tensor<1x32x56x56xf32>, tensor<1x32x56x56xf32>, tensor<1x32x56x56xf32>, tensor<1x32x56x56xf32>, tensor<1x32x56x56xf32>) -> tensor<1x256x56x56xf32>
    %272 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<256x1x1xf32>} : () -> tensor<256x1x1xf32>
    %273 = "onnx.Mul"(%271, %272) : (tensor<1x256x56x56xf32>, tensor<256x1x1xf32>) -> tensor<1x256x56x56xf32>
    %274 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<256x1x1xf32>} : () -> tensor<256x1x1xf32>
    %275 = "onnx.Add"(%273, %274) : (tensor<1x256x56x56xf32>, tensor<256x1x1xf32>) -> tensor<1x256x56x56xf32>
    %276 = "onnx.Relu"(%275) {onnx_node_name = "Relu_41"} : (tensor<1x256x56x56xf32>) -> tensor<1x256x56x56xf32>
    %277 = "onnx.Dim"(%276) {axis = 0 : si64} : (tensor<1x256x56x56xf32>) -> tensor<1xi64>
    %278 = "onnx.Constant"() {value = dense<256> : tensor<1xi64>} : () -> tensor<1xi64>
    %279 = "onnx.Constant"() {value = dense<-1> : tensor<1xi64>} : () -> tensor<1xi64>
    %280 = "onnx.Concat"(%277, %278, %279) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<3xi64>
    %281 = "onnx.Reshape"(%276, %280) {allowzero = 0 : si64} : (tensor<1x256x56x56xf32>, tensor<3xi64>) -> tensor<1x256x?xf32>
    %282 = "onnx.Constant"() {value = dense<[128, -1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %283 = "onnx.Reshape"(%7, %282) {allowzero = 0 : si64} : (tensor<128x256x1x1xf32>, tensor<2xi64>) -> tensor<128x256xf32>
    %284 = "onnx.MatMul"(%283, %281) : (tensor<128x256xf32>, tensor<1x256x?xf32>) -> tensor<1x128x?xf32>
    %285 = "onnx.Dim"(%276) {axis = 0 : si64} : (tensor<1x256x56x56xf32>) -> tensor<1xi64>
    %286 = "onnx.Constant"() {value = dense<56> : tensor<1xi64>} : () -> tensor<1xi64>
    %287 = "onnx.Constant"() {value = dense<56> : tensor<1xi64>} : () -> tensor<1xi64>
    %288 = "onnx.Constant"() {value = dense<128> : tensor<1xi64>} : () -> tensor<1xi64>
    %289 = "onnx.Concat"(%285, %288, %286, %287) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<4xi64>
    %290 = "onnx.Reshape"(%284, %289) {allowzero = 0 : si64} : (tensor<1x128x?xf32>, tensor<4xi64>) -> tensor<1x128x56x56xf32>
    %291 = "onnx.AveragePool"(%290) {auto_pad = "NOTSET", ceil_mode = 0 : si64, count_include_pad = 0 : si64, kernel_shape = [2, 2], onnx_node_name = "AveragePool_45", pads = [0, 0, 0, 0], strides = [2, 2]} : (tensor<1x128x56x56xf32>) -> tensor<1x128x28x28xf32>
    %292 = "onnx.Concat"(%291) {axis = 1 : si64, onnx_node_name = "Concat_46"} : (tensor<1x128x28x28xf32>) -> tensor<1x128x28x28xf32>
    %293 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x1x1xf32>} : () -> tensor<128x1x1xf32>
    %294 = "onnx.Mul"(%292, %293) : (tensor<1x128x28x28xf32>, tensor<128x1x1xf32>) -> tensor<1x128x28x28xf32>
    %295 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x1x1xf32>} : () -> tensor<128x1x1xf32>
    %296 = "onnx.Add"(%294, %295) : (tensor<1x128x28x28xf32>, tensor<128x1x1xf32>) -> tensor<1x128x28x28xf32>
    %297 = "onnx.Relu"(%296) {onnx_node_name = "Relu_48"} : (tensor<1x128x28x28xf32>) -> tensor<1x128x28x28xf32>
    %298 = "onnx.Dim"(%297) {axis = 0 : si64} : (tensor<1x128x28x28xf32>) -> tensor<1xi64>
    %299 = "onnx.Constant"() {value = dense<128> : tensor<1xi64>} : () -> tensor<1xi64>
    %300 = "onnx.Constant"() {value = dense<-1> : tensor<1xi64>} : () -> tensor<1xi64>
    %301 = "onnx.Concat"(%298, %299, %300) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<3xi64>
    %302 = "onnx.Reshape"(%297, %301) {allowzero = 0 : si64} : (tensor<1x128x28x28xf32>, tensor<3xi64>) -> tensor<1x128x?xf32>
    %303 = "onnx.Constant"() {value = dense<[128, -1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %304 = "onnx.Reshape"(%72, %303) {allowzero = 0 : si64} : (tensor<128x128x1x1xf32>, tensor<2xi64>) -> tensor<128x128xf32>
    %305 = "onnx.MatMul"(%304, %302) : (tensor<128x128xf32>, tensor<1x128x?xf32>) -> tensor<1x128x?xf32>
    %306 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x128x1xf32>} : () -> tensor<1x128x1xf32>
    %307 = "onnx.Add"(%305, %306) : (tensor<1x128x?xf32>, tensor<1x128x1xf32>) -> tensor<1x128x?xf32>
    %308 = "onnx.Dim"(%297) {axis = 0 : si64} : (tensor<1x128x28x28xf32>) -> tensor<1xi64>
    %309 = "onnx.Constant"() {value = dense<28> : tensor<1xi64>} : () -> tensor<1xi64>
    %310 = "onnx.Constant"() {value = dense<28> : tensor<1xi64>} : () -> tensor<1xi64>
    %311 = "onnx.Constant"() {value = dense<128> : tensor<1xi64>} : () -> tensor<1xi64>
    %312 = "onnx.Concat"(%308, %311, %309, %310) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<4xi64>
    %313 = "onnx.Reshape"(%307, %312) {allowzero = 0 : si64} : (tensor<1x128x?xf32>, tensor<4xi64>) -> tensor<1x128x28x28xf32>
    %314 = "onnx.Relu"(%313) {onnx_node_name = "Relu_50"} : (tensor<1x128x28x28xf32>) -> tensor<1x128x28x28xf32>
    %315 = "onnx.Conv"(%314, %8, %0) {auto_pad = "NOTSET", dilations = [1, 1], group = 1 : si64, kernel_shape = [3, 3], onnx_node_name = "Conv_51", pads = [1, 1, 1, 1], strides = [1, 1]} : (tensor<1x128x28x28xf32>, tensor<32x128x3x3xf32>, none) -> tensor<1x32x28x28xf32>
    %316 = "onnx.Concat"(%291, %315) {axis = 1 : si64, onnx_node_name = "Concat_52"} : (tensor<1x128x28x28xf32>, tensor<1x32x28x28xf32>) -> tensor<1x160x28x28xf32>
    %317 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<160x1x1xf32>} : () -> tensor<160x1x1xf32>
    %318 = "onnx.Mul"(%316, %317) : (tensor<1x160x28x28xf32>, tensor<160x1x1xf32>) -> tensor<1x160x28x28xf32>
    %319 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<160x1x1xf32>} : () -> tensor<160x1x1xf32>
    %320 = "onnx.Add"(%318, %319) : (tensor<1x160x28x28xf32>, tensor<160x1x1xf32>) -> tensor<1x160x28x28xf32>
    %321 = "onnx.Relu"(%320) {onnx_node_name = "Relu_54"} : (tensor<1x160x28x28xf32>) -> tensor<1x160x28x28xf32>
    %322 = "onnx.Dim"(%321) {axis = 0 : si64} : (tensor<1x160x28x28xf32>) -> tensor<1xi64>
    %323 = "onnx.Constant"() {value = dense<160> : tensor<1xi64>} : () -> tensor<1xi64>
    %324 = "onnx.Constant"() {value = dense<-1> : tensor<1xi64>} : () -> tensor<1xi64>
    %325 = "onnx.Concat"(%322, %323, %324) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<3xi64>
    %326 = "onnx.Reshape"(%321, %325) {allowzero = 0 : si64} : (tensor<1x160x28x28xf32>, tensor<3xi64>) -> tensor<1x160x?xf32>
    %327 = "onnx.Constant"() {value = dense<[128, -1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %328 = "onnx.Reshape"(%73, %327) {allowzero = 0 : si64} : (tensor<128x160x1x1xf32>, tensor<2xi64>) -> tensor<128x160xf32>
    %329 = "onnx.MatMul"(%328, %326) : (tensor<128x160xf32>, tensor<1x160x?xf32>) -> tensor<1x128x?xf32>
    %330 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x128x1xf32>} : () -> tensor<1x128x1xf32>
    %331 = "onnx.Add"(%329, %330) : (tensor<1x128x?xf32>, tensor<1x128x1xf32>) -> tensor<1x128x?xf32>
    %332 = "onnx.Dim"(%321) {axis = 0 : si64} : (tensor<1x160x28x28xf32>) -> tensor<1xi64>
    %333 = "onnx.Constant"() {value = dense<28> : tensor<1xi64>} : () -> tensor<1xi64>
    %334 = "onnx.Constant"() {value = dense<28> : tensor<1xi64>} : () -> tensor<1xi64>
    %335 = "onnx.Constant"() {value = dense<128> : tensor<1xi64>} : () -> tensor<1xi64>
    %336 = "onnx.Concat"(%332, %335, %333, %334) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<4xi64>
    %337 = "onnx.Reshape"(%331, %336) {allowzero = 0 : si64} : (tensor<1x128x?xf32>, tensor<4xi64>) -> tensor<1x128x28x28xf32>
    %338 = "onnx.Relu"(%337) {onnx_node_name = "Relu_56"} : (tensor<1x128x28x28xf32>) -> tensor<1x128x28x28xf32>
    %339 = "onnx.Conv"(%338, %9, %0) {auto_pad = "NOTSET", dilations = [1, 1], group = 1 : si64, kernel_shape = [3, 3], onnx_node_name = "Conv_57", pads = [1, 1, 1, 1], strides = [1, 1]} : (tensor<1x128x28x28xf32>, tensor<32x128x3x3xf32>, none) -> tensor<1x32x28x28xf32>
    %340 = "onnx.Concat"(%291, %315, %339) {axis = 1 : si64, onnx_node_name = "Concat_58"} : (tensor<1x128x28x28xf32>, tensor<1x32x28x28xf32>, tensor<1x32x28x28xf32>) -> tensor<1x192x28x28xf32>
    %341 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<192x1x1xf32>} : () -> tensor<192x1x1xf32>
    %342 = "onnx.Mul"(%340, %341) : (tensor<1x192x28x28xf32>, tensor<192x1x1xf32>) -> tensor<1x192x28x28xf32>
    %343 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<192x1x1xf32>} : () -> tensor<192x1x1xf32>
    %344 = "onnx.Add"(%342, %343) : (tensor<1x192x28x28xf32>, tensor<192x1x1xf32>) -> tensor<1x192x28x28xf32>
    %345 = "onnx.Relu"(%344) {onnx_node_name = "Relu_60"} : (tensor<1x192x28x28xf32>) -> tensor<1x192x28x28xf32>
    %346 = "onnx.Dim"(%345) {axis = 0 : si64} : (tensor<1x192x28x28xf32>) -> tensor<1xi64>
    %347 = "onnx.Constant"() {value = dense<192> : tensor<1xi64>} : () -> tensor<1xi64>
    %348 = "onnx.Constant"() {value = dense<-1> : tensor<1xi64>} : () -> tensor<1xi64>
    %349 = "onnx.Concat"(%346, %347, %348) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<3xi64>
    %350 = "onnx.Reshape"(%345, %349) {allowzero = 0 : si64} : (tensor<1x192x28x28xf32>, tensor<3xi64>) -> tensor<1x192x?xf32>
    %351 = "onnx.Constant"() {value = dense<[128, -1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %352 = "onnx.Reshape"(%74, %351) {allowzero = 0 : si64} : (tensor<128x192x1x1xf32>, tensor<2xi64>) -> tensor<128x192xf32>
    %353 = "onnx.MatMul"(%352, %350) : (tensor<128x192xf32>, tensor<1x192x?xf32>) -> tensor<1x128x?xf32>
    %354 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x128x1xf32>} : () -> tensor<1x128x1xf32>
    %355 = "onnx.Add"(%353, %354) : (tensor<1x128x?xf32>, tensor<1x128x1xf32>) -> tensor<1x128x?xf32>
    %356 = "onnx.Dim"(%345) {axis = 0 : si64} : (tensor<1x192x28x28xf32>) -> tensor<1xi64>
    %357 = "onnx.Constant"() {value = dense<28> : tensor<1xi64>} : () -> tensor<1xi64>
    %358 = "onnx.Constant"() {value = dense<28> : tensor<1xi64>} : () -> tensor<1xi64>
    %359 = "onnx.Constant"() {value = dense<128> : tensor<1xi64>} : () -> tensor<1xi64>
    %360 = "onnx.Concat"(%356, %359, %357, %358) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>, tensor<1xi64>, tensor<1xi64>) -> tensor<4xi64>
    %361 = "onnx.Reshape"(%355, %360) {allowzero = 0 : si64} : (tensor<1x128x?xf32>, tensor<4xi64>) -> tensor<1x128x28x28xf32>
