module attributes {llvm.data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", llvm.target_triple = "x86_64-unknown-linux-gnu"} {
  func.func @main_graph(%arg0: tensor<1x28x28xf32>) -> tensor<?x10xf32> attributes {input_names = ["Placeholder:0"], output_names = ["Softmax:0"]} {
    %0 = "onnx.NoValue"() {value} : () -> none
    %1 = "onnx.Constant"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %2 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %3 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %4 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x384xf32>} : () -> tensor<128x384xf32>
    %5 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %6 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128xf32>} : () -> tensor<128xf32>
    %7 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<28x384xf32>} : () -> tensor<28x384xf32>
    %8 = "onnx.Constant"() {value = dense<0.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %9 = "onnx.Constant"() {value = dense<[0, 128]> : tensor<2xi64>} : () -> tensor<2xi64>
    %10 = "onnx.Constant"() {value = dense<0> : tensor<2xi64>} : () -> tensor<2xi64>
    %11 = "onnx.Constant"() {value = dense<[9223372036854775807, 128]> : tensor<2xi64>} : () -> tensor<2xi64>
    %12 = "onnx.Constant"() {value = dense<[9223372036854775807, 256]> : tensor<2xi64>} : () -> tensor<2xi64>
    %13 = "onnx.Constant"() {value = dense<1> : tensor<1xi64>} : () -> tensor<1xi64>
    %14 = "onnx.Constant"() {value = dense<[0.282647729, -0.666800737, 0.655130267, 0.48540327, 1.4380765, 1.29160631, 0.00453929696, 0.93725878, -0.0861823708, 0.736010491]> : tensor<10xf32>} : () -> tensor<10xf32>
    %15 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<128x10xf32>} : () -> tensor<128x10xf32>
    %16:28 = "onnx.Split"(%arg0, %0) {axis = 1 : si64, onnx_node_name = "unstack"} : (tensor<1x28x28xf32>, none) -> (tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>, tensor<?x1x28xf32>)
    %17 = "onnx.Squeeze"(%16#1, %13) {onnx_node_name = "unstack__9"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %18 = "onnx.MatMul"(%17, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_1/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %19:3 = "onnx.Split"(%18, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_1/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %20 = "onnx.Add"(%19#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_1/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %21 = "onnx.Sigmoid"(%20) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_1/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %22 = "onnx.Add"(%19#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_1/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %23 = "onnx.Sigmoid"(%22) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_1/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %24 = "onnx.Sub"(%1, %23) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_1/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %25 = "onnx.Mul"(%24, %19#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_1/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %26 = "onnx.Squeeze"(%16#0, %13) {onnx_node_name = "unstack__7"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %27 = "onnx.MatMul"(%26, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %28:3 = "onnx.Split"(%27, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %29 = "onnx.Add"(%28#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %30 = "onnx.Sigmoid"(%29) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %31 = "onnx.Add"(%28#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %32 = "onnx.Sigmoid"(%31) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %33 = "onnx.Sub"(%1, %32) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %34 = "onnx.Mul"(%33, %28#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %35 = "onnx.Dim"(%26) {axis = 0 : si64} : (tensor<?x28xf32>) -> tensor<1xi64>
    %36 = "onnx.Constant"() {value = dense<256> : tensor<1xi64>} : () -> tensor<1xi64>
    %37 = "onnx.Concat"(%35, %36) {axis = 0 : si64} : (tensor<1xi64>, tensor<1xi64>) -> tensor<2xi64>
    %38 = "onnx.Expand"(%8, %37) {onnx_node_name = "rnn/MultiRNNCellZeroState/MultiRNNCellZeroState/zeros"} : (tensor<f32>, tensor<2xi64>) -> tensor<?x?xf32>
    %39 = "onnx.Constant"() {value = dense<[0, 1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %40 = "onnx.Constant"() {value = dense<1> : tensor<2xi64>} : () -> tensor<2xi64>
    %41 = "onnx.Slice"(%38, %9, %12, %39, %40) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1/Slice"} : (tensor<?x?xf32>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>) -> tensor<?x?xf32>
    %42 = "onnx.Constant"() {value = dense<[0, 1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %43 = "onnx.Constant"() {value = dense<1> : tensor<2xi64>} : () -> tensor<2xi64>
    %44 = "onnx.Slice"(%38, %10, %11, %42, %43) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0/Slice"} : (tensor<?x?xf32>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>) -> tensor<?x?xf32>
    %45 = "onnx.Mul"(%32, %44) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0/SRUCell/mul"} : (tensor<?x128xf32>, tensor<?x?xf32>) -> tensor<?x128xf32>
    %46 = "onnx.Add"(%45, %34) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0/SRUCell/add_2"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %47 = "onnx.Tanh"(%46) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0/SRUCell/Tanh"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %48 = "onnx.Mul"(%30, %47) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0/SRUCell/mul_2"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %49 = "onnx.MatMul"(%48, %4) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1/SRUCell/MatMul"} : (tensor<?x128xf32>, tensor<128x384xf32>) -> tensor<?x384xf32>
    %50:3 = "onnx.Split"(%49, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %51 = "onnx.Add"(%50#1, %3) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %52 = "onnx.Sigmoid"(%51) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %53 = "onnx.Sub"(%1, %52) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %54 = "onnx.Mul"(%53, %50#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %55 = "onnx.Mul"(%52, %41) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1/SRUCell/mul"} : (tensor<?x128xf32>, tensor<?x?xf32>) -> tensor<?x128xf32>
    %56 = "onnx.Add"(%55, %54) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1/SRUCell/add_2"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %57 = "onnx.Concat"(%46, %56) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/concat"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x256xf32>
    %58 = "onnx.Constant"() {value = dense<[0, 1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %59 = "onnx.Constant"() {value = dense<1> : tensor<2xi64>} : () -> tensor<2xi64>
    %60 = "onnx.Slice"(%57, %9, %12, %58, %59) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1_1/Slice"} : (tensor<?x256xf32>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>) -> tensor<?x128xf32>
    %61 = "onnx.Constant"() {value = dense<[0, 1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %62 = "onnx.Constant"() {value = dense<1> : tensor<2xi64>} : () -> tensor<2xi64>
    %63 = "onnx.Slice"(%57, %10, %11, %61, %62) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_1/Slice"} : (tensor<?x256xf32>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>) -> tensor<?x128xf32>
    %64 = "onnx.Mul"(%23, %63) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_1/SRUCell/mul"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %65 = "onnx.Add"(%64, %25) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_1/SRUCell/add_2"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %66 = "onnx.Tanh"(%65) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_1/SRUCell/Tanh"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %67 = "onnx.Mul"(%21, %66) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_1/SRUCell/mul_2"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %68 = "onnx.MatMul"(%67, %4) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1_1/SRUCell/MatMul"} : (tensor<?x128xf32>, tensor<128x384xf32>) -> tensor<?x384xf32>
    %69:3 = "onnx.Split"(%68, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1_1/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %70 = "onnx.Add"(%69#1, %3) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1_1/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %71 = "onnx.Sigmoid"(%70) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1_1/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %72 = "onnx.Sub"(%1, %71) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1_1/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %73 = "onnx.Mul"(%72, %69#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1_1/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %74 = "onnx.Mul"(%71, %60) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1_1/SRUCell/mul"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %75 = "onnx.Add"(%74, %73) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1_1/SRUCell/add_2"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %76 = "onnx.Concat"(%65, %75) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/concat_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x256xf32>
    %77 = "onnx.Constant"() {value = dense<[0, 1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %78 = "onnx.Constant"() {value = dense<1> : tensor<2xi64>} : () -> tensor<2xi64>
    %79 = "onnx.Slice"(%76, %9, %12, %77, %78) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_1_2/Slice"} : (tensor<?x256xf32>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>) -> tensor<?x128xf32>
    %80 = "onnx.Constant"() {value = dense<[0, 1]> : tensor<2xi64>} : () -> tensor<2xi64>
    %81 = "onnx.Constant"() {value = dense<1> : tensor<2xi64>} : () -> tensor<2xi64>
    %82 = "onnx.Slice"(%76, %10, %11, %80, %81) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_2/Slice"} : (tensor<?x256xf32>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>, tensor<2xi64>) -> tensor<?x128xf32>
    %83 = "onnx.Squeeze"(%16#27, %13) {onnx_node_name = "unstack__61"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %84 = "onnx.MatMul"(%83, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_27/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %85:3 = "onnx.Split"(%84, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_27/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %86 = "onnx.Add"(%85#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_27/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %87 = "onnx.Sigmoid"(%86) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_27/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %88 = "onnx.Add"(%85#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_27/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %89 = "onnx.Sigmoid"(%88) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_27/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %90 = "onnx.Sub"(%1, %89) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_27/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %91 = "onnx.Mul"(%90, %85#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_27/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %92 = "onnx.Squeeze"(%16#26, %13) {onnx_node_name = "unstack__59"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %93 = "onnx.MatMul"(%92, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_26/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %94:3 = "onnx.Split"(%93, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_26/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %95 = "onnx.Add"(%94#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_26/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %96 = "onnx.Sigmoid"(%95) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_26/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %97 = "onnx.Add"(%94#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_26/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %98 = "onnx.Sigmoid"(%97) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_26/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %99 = "onnx.Sub"(%1, %98) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_26/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %100 = "onnx.Mul"(%99, %94#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_26/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %101 = "onnx.Squeeze"(%16#25, %13) {onnx_node_name = "unstack__57"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %102 = "onnx.MatMul"(%101, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_25/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %103:3 = "onnx.Split"(%102, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_25/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %104 = "onnx.Add"(%103#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_25/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %105 = "onnx.Sigmoid"(%104) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_25/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %106 = "onnx.Add"(%103#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_25/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %107 = "onnx.Sigmoid"(%106) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_25/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %108 = "onnx.Sub"(%1, %107) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_25/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %109 = "onnx.Mul"(%108, %103#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_25/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %110 = "onnx.Squeeze"(%16#24, %13) {onnx_node_name = "unstack__55"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %111 = "onnx.MatMul"(%110, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_24/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %112:3 = "onnx.Split"(%111, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_24/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %113 = "onnx.Add"(%112#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_24/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %114 = "onnx.Sigmoid"(%113) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_24/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %115 = "onnx.Add"(%112#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_24/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %116 = "onnx.Sigmoid"(%115) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_24/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %117 = "onnx.Sub"(%1, %116) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_24/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %118 = "onnx.Mul"(%117, %112#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_24/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %119 = "onnx.Squeeze"(%16#23, %13) {onnx_node_name = "unstack__53"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %120 = "onnx.MatMul"(%119, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_23/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %121:3 = "onnx.Split"(%120, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_23/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %122 = "onnx.Add"(%121#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_23/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %123 = "onnx.Sigmoid"(%122) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_23/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %124 = "onnx.Add"(%121#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_23/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %125 = "onnx.Sigmoid"(%124) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_23/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %126 = "onnx.Sub"(%1, %125) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_23/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %127 = "onnx.Mul"(%126, %121#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_23/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %128 = "onnx.Squeeze"(%16#22, %13) {onnx_node_name = "unstack__51"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %129 = "onnx.MatMul"(%128, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_22/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %130:3 = "onnx.Split"(%129, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_22/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %131 = "onnx.Add"(%130#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_22/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %132 = "onnx.Sigmoid"(%131) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_22/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %133 = "onnx.Add"(%130#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_22/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %134 = "onnx.Sigmoid"(%133) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_22/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %135 = "onnx.Sub"(%1, %134) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_22/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %136 = "onnx.Mul"(%135, %130#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_22/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %137 = "onnx.Squeeze"(%16#21, %13) {onnx_node_name = "unstack__49"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %138 = "onnx.MatMul"(%137, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_21/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %139:3 = "onnx.Split"(%138, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_21/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %140 = "onnx.Add"(%139#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_21/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %141 = "onnx.Sigmoid"(%140) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_21/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %142 = "onnx.Add"(%139#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_21/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %143 = "onnx.Sigmoid"(%142) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_21/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %144 = "onnx.Sub"(%1, %143) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_21/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %145 = "onnx.Mul"(%144, %139#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_21/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %146 = "onnx.Squeeze"(%16#20, %13) {onnx_node_name = "unstack__47"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %147 = "onnx.MatMul"(%146, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_20/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %148:3 = "onnx.Split"(%147, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_20/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %149 = "onnx.Add"(%148#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_20/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %150 = "onnx.Sigmoid"(%149) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_20/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %151 = "onnx.Add"(%148#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_20/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %152 = "onnx.Sigmoid"(%151) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_20/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %153 = "onnx.Sub"(%1, %152) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_20/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %154 = "onnx.Mul"(%153, %148#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_20/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %155 = "onnx.Squeeze"(%16#19, %13) {onnx_node_name = "unstack__45"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %156 = "onnx.MatMul"(%155, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_19/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %157:3 = "onnx.Split"(%156, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_19/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %158 = "onnx.Add"(%157#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_19/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %159 = "onnx.Sigmoid"(%158) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_19/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %160 = "onnx.Add"(%157#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_19/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %161 = "onnx.Sigmoid"(%160) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_19/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %162 = "onnx.Sub"(%1, %161) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_19/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %163 = "onnx.Mul"(%162, %157#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_19/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %164 = "onnx.Squeeze"(%16#18, %13) {onnx_node_name = "unstack__43"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %165 = "onnx.MatMul"(%164, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_18/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %166:3 = "onnx.Split"(%165, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_18/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %167 = "onnx.Add"(%166#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_18/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %168 = "onnx.Sigmoid"(%167) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_18/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %169 = "onnx.Add"(%166#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_18/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %170 = "onnx.Sigmoid"(%169) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_18/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %171 = "onnx.Sub"(%1, %170) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_18/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %172 = "onnx.Mul"(%171, %166#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_18/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %173 = "onnx.Squeeze"(%16#17, %13) {onnx_node_name = "unstack__41"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %174 = "onnx.MatMul"(%173, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_17/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %175:3 = "onnx.Split"(%174, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_17/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %176 = "onnx.Add"(%175#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_17/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %177 = "onnx.Sigmoid"(%176) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_17/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %178 = "onnx.Add"(%175#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_17/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %179 = "onnx.Sigmoid"(%178) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_17/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %180 = "onnx.Sub"(%1, %179) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_17/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %181 = "onnx.Mul"(%180, %175#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_17/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %182 = "onnx.Squeeze"(%16#16, %13) {onnx_node_name = "unstack__39"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %183 = "onnx.MatMul"(%182, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_16/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %184:3 = "onnx.Split"(%183, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_16/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %185 = "onnx.Add"(%184#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_16/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %186 = "onnx.Sigmoid"(%185) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_16/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %187 = "onnx.Add"(%184#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_16/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %188 = "onnx.Sigmoid"(%187) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_16/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %189 = "onnx.Sub"(%1, %188) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_16/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %190 = "onnx.Mul"(%189, %184#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_16/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %191 = "onnx.Squeeze"(%16#15, %13) {onnx_node_name = "unstack__37"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %192 = "onnx.MatMul"(%191, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_15/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %193:3 = "onnx.Split"(%192, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_15/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %194 = "onnx.Add"(%193#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_15/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %195 = "onnx.Sigmoid"(%194) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_15/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %196 = "onnx.Add"(%193#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_15/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %197 = "onnx.Sigmoid"(%196) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_15/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %198 = "onnx.Sub"(%1, %197) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_15/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %199 = "onnx.Mul"(%198, %193#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_15/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %200 = "onnx.Squeeze"(%16#14, %13) {onnx_node_name = "unstack__35"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %201 = "onnx.MatMul"(%200, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_14/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %202:3 = "onnx.Split"(%201, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_14/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %203 = "onnx.Add"(%202#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_14/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %204 = "onnx.Sigmoid"(%203) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_14/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %205 = "onnx.Add"(%202#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_14/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %206 = "onnx.Sigmoid"(%205) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_14/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %207 = "onnx.Sub"(%1, %206) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_14/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %208 = "onnx.Mul"(%207, %202#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_14/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %209 = "onnx.Squeeze"(%16#13, %13) {onnx_node_name = "unstack__33"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %210 = "onnx.MatMul"(%209, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_13/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %211:3 = "onnx.Split"(%210, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_13/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %212 = "onnx.Add"(%211#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_13/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %213 = "onnx.Sigmoid"(%212) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_13/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %214 = "onnx.Add"(%211#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_13/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %215 = "onnx.Sigmoid"(%214) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_13/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %216 = "onnx.Sub"(%1, %215) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_13/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %217 = "onnx.Mul"(%216, %211#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_13/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %218 = "onnx.Squeeze"(%16#12, %13) {onnx_node_name = "unstack__31"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %219 = "onnx.MatMul"(%218, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_12/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %220:3 = "onnx.Split"(%219, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_12/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %221 = "onnx.Add"(%220#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_12/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %222 = "onnx.Sigmoid"(%221) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_12/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %223 = "onnx.Add"(%220#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_12/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %224 = "onnx.Sigmoid"(%223) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_12/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %225 = "onnx.Sub"(%1, %224) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_12/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %226 = "onnx.Mul"(%225, %220#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_12/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %227 = "onnx.Squeeze"(%16#11, %13) {onnx_node_name = "unstack__29"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %228 = "onnx.MatMul"(%227, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_11/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %229:3 = "onnx.Split"(%228, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_11/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %230 = "onnx.Add"(%229#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_11/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %231 = "onnx.Sigmoid"(%230) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_11/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %232 = "onnx.Add"(%229#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_11/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %233 = "onnx.Sigmoid"(%232) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_11/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %234 = "onnx.Sub"(%1, %233) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_11/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %235 = "onnx.Mul"(%234, %229#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_11/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %236 = "onnx.Squeeze"(%16#10, %13) {onnx_node_name = "unstack__27"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %237 = "onnx.MatMul"(%236, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_10/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %238:3 = "onnx.Split"(%237, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_10/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %239 = "onnx.Add"(%238#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_10/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %240 = "onnx.Sigmoid"(%239) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_10/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %241 = "onnx.Add"(%238#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_10/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %242 = "onnx.Sigmoid"(%241) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_10/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %243 = "onnx.Sub"(%1, %242) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_10/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %244 = "onnx.Mul"(%243, %238#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_10/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %245 = "onnx.Squeeze"(%16#9, %13) {onnx_node_name = "unstack__25"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %246 = "onnx.MatMul"(%245, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_9/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %247:3 = "onnx.Split"(%246, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_9/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %248 = "onnx.Add"(%247#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_9/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %249 = "onnx.Sigmoid"(%248) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_9/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %250 = "onnx.Add"(%247#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_9/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %251 = "onnx.Sigmoid"(%250) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_9/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %252 = "onnx.Sub"(%1, %251) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_9/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %253 = "onnx.Mul"(%252, %247#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_9/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %254 = "onnx.Squeeze"(%16#8, %13) {onnx_node_name = "unstack__23"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %255 = "onnx.MatMul"(%254, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_8/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %256:3 = "onnx.Split"(%255, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_8/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %257 = "onnx.Add"(%256#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_8/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %258 = "onnx.Sigmoid"(%257) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_8/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %259 = "onnx.Add"(%256#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_8/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %260 = "onnx.Sigmoid"(%259) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_8/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %261 = "onnx.Sub"(%1, %260) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_8/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %262 = "onnx.Mul"(%261, %256#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_8/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %263 = "onnx.Squeeze"(%16#7, %13) {onnx_node_name = "unstack__21"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %264 = "onnx.MatMul"(%263, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_7/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %265:3 = "onnx.Split"(%264, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_7/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %266 = "onnx.Add"(%265#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_7/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %267 = "onnx.Sigmoid"(%266) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_7/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %268 = "onnx.Add"(%265#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_7/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %269 = "onnx.Sigmoid"(%268) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_7/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %270 = "onnx.Sub"(%1, %269) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_7/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %271 = "onnx.Mul"(%270, %265#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_7/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %272 = "onnx.Squeeze"(%16#6, %13) {onnx_node_name = "unstack__19"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %273 = "onnx.MatMul"(%272, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_6/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %274:3 = "onnx.Split"(%273, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_6/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %275 = "onnx.Add"(%274#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_6/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %276 = "onnx.Sigmoid"(%275) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_6/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %277 = "onnx.Add"(%274#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_6/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %278 = "onnx.Sigmoid"(%277) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_6/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %279 = "onnx.Sub"(%1, %278) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_6/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %280 = "onnx.Mul"(%279, %274#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_6/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %281 = "onnx.Squeeze"(%16#5, %13) {onnx_node_name = "unstack__17"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %282 = "onnx.MatMul"(%281, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_5/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %283:3 = "onnx.Split"(%282, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_5/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %284 = "onnx.Add"(%283#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_5/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %285 = "onnx.Sigmoid"(%284) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_5/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %286 = "onnx.Add"(%283#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_5/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %287 = "onnx.Sigmoid"(%286) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_5/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %288 = "onnx.Sub"(%1, %287) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_5/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %289 = "onnx.Mul"(%288, %283#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_5/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %290 = "onnx.Squeeze"(%16#4, %13) {onnx_node_name = "unstack__15"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %291 = "onnx.MatMul"(%290, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_4/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %292:3 = "onnx.Split"(%291, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_4/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %293 = "onnx.Add"(%292#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_4/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %294 = "onnx.Sigmoid"(%293) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_4/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %295 = "onnx.Add"(%292#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_4/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %296 = "onnx.Sigmoid"(%295) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_4/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %297 = "onnx.Sub"(%1, %296) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_4/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %298 = "onnx.Mul"(%297, %292#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_4/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %299 = "onnx.Squeeze"(%16#3, %13) {onnx_node_name = "unstack__13"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %300 = "onnx.MatMul"(%299, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_3/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %301:3 = "onnx.Split"(%300, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_3/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %302 = "onnx.Add"(%301#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_3/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %303 = "onnx.Sigmoid"(%302) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_3/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %304 = "onnx.Add"(%301#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_3/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %305 = "onnx.Sigmoid"(%304) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_3/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %306 = "onnx.Sub"(%1, %305) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_3/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %307 = "onnx.Mul"(%306, %301#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_3/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %308 = "onnx.Squeeze"(%16#2, %13) {onnx_node_name = "unstack__11"} : (tensor<?x1x28xf32>, tensor<1xi64>) -> tensor<?x28xf32>
    %309 = "onnx.MatMul"(%308, %7) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_2/SRUCell/MatMul"} : (tensor<?x28xf32>, tensor<28x384xf32>) -> tensor<?x384xf32>
    %310:3 = "onnx.Split"(%309, %0) {axis = 1 : si64, onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_2/SRUCell/split"} : (tensor<?x384xf32>, none) -> (tensor<?x128xf32>, tensor<?x128xf32>, tensor<?x128xf32>)
    %311 = "onnx.Add"(%310#2, %5) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_2/SRUCell/add_1"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %312 = "onnx.Sigmoid"(%311) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_2/SRUCell/Sigmoid_1"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %313 = "onnx.Add"(%310#1, %6) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_2/SRUCell/add"} : (tensor<?x128xf32>, tensor<128xf32>) -> tensor<?x128xf32>
    %314 = "onnx.Sigmoid"(%313) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_2/SRUCell/Sigmoid"} : (tensor<?x128xf32>) -> tensor<?x128xf32>
    %315 = "onnx.Sub"(%1, %314) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_2/SRUCell/sub"} : (tensor<f32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %316 = "onnx.Mul"(%315, %310#0) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_2/SRUCell/mul_1"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %317 = "onnx.Mul"(%314, %82) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_2/SRUCell/mul"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
    %318 = "onnx.Add"(%317, %316) {onnx_node_name = "rnn/rnn/multi_rnn_cell/cell_0_2/SRUCell/add_2"} : (tensor<?x128xf32>, tensor<?x128xf32>) -> tensor<?x128xf32>
