module attributes {llvm.data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", llvm.target_triple = "x86_64-unknown-linux-gnu"} {
  func.func @main_graph(%arg0: tensor<2x1x3x8x224x224xf32>) -> tensor<1x400xf32> attributes {input_names = ["0"], output_names = ["1528"]} {
    %0 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %1 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x2304xf32>} : () -> tensor<768x2304xf32>
    %2 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x768xf32>} : () -> tensor<768x768xf32>
    %3 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %4 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x3072xf32>} : () -> tensor<768x3072xf32>
    %5 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072x768xf32>} : () -> tensor<3072x768xf32>
    %6 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %7 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x2304xf32>} : () -> tensor<768x2304xf32>
    %8 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x768xf32>} : () -> tensor<768x768xf32>
    %9 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %10 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x3072xf32>} : () -> tensor<768x3072xf32>
    %11 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072x768xf32>} : () -> tensor<3072x768xf32>
    %12 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %13 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x2304xf32>} : () -> tensor<768x2304xf32>
    %14 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x768xf32>} : () -> tensor<768x768xf32>
    %15 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %16 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x3072xf32>} : () -> tensor<768x3072xf32>
    %17 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072x768xf32>} : () -> tensor<3072x768xf32>
    %18 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %19 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x2304xf32>} : () -> tensor<768x2304xf32>
    %20 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x768xf32>} : () -> tensor<768x768xf32>
    %21 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %22 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x3072xf32>} : () -> tensor<768x3072xf32>
    %23 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072x768xf32>} : () -> tensor<3072x768xf32>
    %24 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %25 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x2304xf32>} : () -> tensor<768x2304xf32>
    %26 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x768xf32>} : () -> tensor<768x768xf32>
    %27 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %28 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x3072xf32>} : () -> tensor<768x3072xf32>
    %29 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072x768xf32>} : () -> tensor<3072x768xf32>
    %30 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %31 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x2304xf32>} : () -> tensor<768x2304xf32>
    %32 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x768xf32>} : () -> tensor<768x768xf32>
    %33 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %34 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x3072xf32>} : () -> tensor<768x3072xf32>
    %35 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072x768xf32>} : () -> tensor<3072x768xf32>
    %36 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %37 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x2304xf32>} : () -> tensor<768x2304xf32>
    %38 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x768xf32>} : () -> tensor<768x768xf32>
    %39 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %40 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x3072xf32>} : () -> tensor<768x3072xf32>
    %41 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072x768xf32>} : () -> tensor<3072x768xf32>
    %42 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %43 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x2304xf32>} : () -> tensor<768x2304xf32>
    %44 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x768xf32>} : () -> tensor<768x768xf32>
    %45 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %46 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x3072xf32>} : () -> tensor<768x3072xf32>
    %47 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072x768xf32>} : () -> tensor<3072x768xf32>
    %48 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %49 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x2304xf32>} : () -> tensor<768x2304xf32>
    %50 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x768xf32>} : () -> tensor<768x768xf32>
    %51 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %52 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x3072xf32>} : () -> tensor<768x3072xf32>
    %53 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072x768xf32>} : () -> tensor<3072x768xf32>
    %54 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %55 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x2304xf32>} : () -> tensor<768x2304xf32>
    %56 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x768xf32>} : () -> tensor<768x768xf32>
    %57 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %58 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x3072xf32>} : () -> tensor<768x3072xf32>
    %59 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072x768xf32>} : () -> tensor<3072x768xf32>
    %60 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %61 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x2304xf32>} : () -> tensor<768x2304xf32>
    %62 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x768xf32>} : () -> tensor<768x768xf32>
    %63 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %64 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x3072xf32>} : () -> tensor<768x3072xf32>
    %65 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072x768xf32>} : () -> tensor<3072x768xf32>
    %66 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %67 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x2304xf32>} : () -> tensor<768x2304xf32>
    %68 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x768xf32>} : () -> tensor<768x768xf32>
    %69 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %70 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x3072xf32>} : () -> tensor<768x3072xf32>
    %71 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072x768xf32>} : () -> tensor<3072x768xf32>
    %72 = "onnx.Constant"() {value = dense<2.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %73 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %74 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %75 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %76 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768x3x16x16xf32>} : () -> tensor<768x3x16x16xf32>
    %77 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x197x768xf32>} : () -> tensor<1x197x768xf32>
    %78 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<2304xf32>} : () -> tensor<2304xf32>
    %79 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %80 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072xf32>} : () -> tensor<3072xf32>
    %81 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %82 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %83 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %84 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %85 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<2304xf32>} : () -> tensor<2304xf32>
    %86 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %87 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072xf32>} : () -> tensor<3072xf32>
    %88 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %89 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %90 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %91 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %92 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<2304xf32>} : () -> tensor<2304xf32>
    %93 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %94 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072xf32>} : () -> tensor<3072xf32>
    %95 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %96 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %97 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %98 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %99 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<2304xf32>} : () -> tensor<2304xf32>
    %100 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %101 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072xf32>} : () -> tensor<3072xf32>
    %102 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %103 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %104 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %105 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %106 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<2304xf32>} : () -> tensor<2304xf32>
    %107 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %108 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072xf32>} : () -> tensor<3072xf32>
    %109 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %110 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %111 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %112 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %113 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<2304xf32>} : () -> tensor<2304xf32>
    %114 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %115 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072xf32>} : () -> tensor<3072xf32>
    %116 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %117 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %118 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %119 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %120 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<2304xf32>} : () -> tensor<2304xf32>
    %121 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %122 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072xf32>} : () -> tensor<3072xf32>
    %123 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %124 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %125 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %126 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %127 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<2304xf32>} : () -> tensor<2304xf32>
    %128 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %129 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072xf32>} : () -> tensor<3072xf32>
    %130 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %131 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %132 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %133 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %134 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<2304xf32>} : () -> tensor<2304xf32>
    %135 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %136 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072xf32>} : () -> tensor<3072xf32>
    %137 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %138 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %139 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %140 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %141 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<2304xf32>} : () -> tensor<2304xf32>
    %142 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %143 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072xf32>} : () -> tensor<3072xf32>
    %144 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %145 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %146 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %147 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %148 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<2304xf32>} : () -> tensor<2304xf32>
    %149 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %150 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072xf32>} : () -> tensor<3072xf32>
    %151 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %152 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %153 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %154 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %155 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<2304xf32>} : () -> tensor<2304xf32>
    %156 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %157 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<3072xf32>} : () -> tensor<3072xf32>
    %158 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %159 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %160 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %161 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<768xf32>} : () -> tensor<768xf32>
    %162 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<400xf32>} : () -> tensor<400xf32>
    %163 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<400x768xf32>} : () -> tensor<400x768xf32>
    %164 = "onnx.Constant"() {value = dense<0> : tensor<i64>} : () -> tensor<i64>
    %165 = "onnx.Constant"() {value = dense<9.99999997E-7> : tensor<f32>} : () -> tensor<f32>
    %166 = "onnx.Constant"() {value = dense<1.250000e-01> : tensor<f32>} : () -> tensor<f32>
    %167 = "onnx.Constant"() {value = dense<1.41421354> : tensor<f32>} : () -> tensor<f32>
    %168 = "onnx.Constant"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>
    %169 = "onnx.Constant"() {value = dense<5.000000e-01> : tensor<f32>} : () -> tensor<f32>
    %170 = "onnx.Constant"() {value = dense<[-1, 3, 8, 224, 224]> : tensor<5xi64>} : () -> tensor<5xi64>
    %171 = "onnx.Constant"() {value = dense<[8, 3, 224, 224]> : tensor<4xi64>} : () -> tensor<4xi64>
    %172 = "onnx.Constant"() {value = dense<[8, 768, -1]> : tensor<3xi64>} : () -> tensor<3xi64>
    %173 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<8x1x768xf32>} : () -> tensor<8x1x768xf32>
    %174 = "onnx.Constant"() {value = dense<[197, 96, 64]> : tensor<3xi64>} : () -> tensor<3xi64>
    %175 = "onnx.Constant"() {value = dense<[-1, 96, 64]> : tensor<3xi64>} : () -> tensor<3xi64>
    %176 = "onnx.Constant"() {value = dense<[197, 8, 768]> : tensor<3xi64>} : () -> tensor<3xi64>
    %177 = "onnx.Constant"() {value = dense<[-1, 8, 197, 768]> : tensor<4xi64>} : () -> tensor<4xi64>
    %178 = "onnx.Reshape"(%arg0, %170) {allowzero = 0 : si64, onnx_node_name = "Reshape_17"} : (tensor<2x1x3x8x224x224xf32>, tensor<5xi64>) -> tensor<1x3x8x224x224xf32>
    %179 = "onnx.Transpose"(%178) {onnx_node_name = "Transpose_69", perm = [0, 2, 1, 3, 4]} : (tensor<1x3x8x224x224xf32>) -> tensor<1x8x3x224x224xf32>
    %180 = "onnx.Reshape"(%179, %171) {allowzero = 0 : si64, onnx_node_name = "Reshape_75"} : (tensor<1x8x3x224x224xf32>, tensor<4xi64>) -> tensor<8x3x224x224xf32>
    %181 = "onnx.Conv"(%180, %76, %75) {auto_pad = "NOTSET", dilations = [1, 1], group = 1 : si64, kernel_shape = [16, 16], onnx_node_name = "Conv_76", pads = [0, 0, 0, 0], strides = [16, 16]} : (tensor<8x3x224x224xf32>, tensor<768x3x16x16xf32>, tensor<768xf32>) -> tensor<8x768x14x14xf32>
    %182 = "onnx.Reshape"(%181, %172) {allowzero = 0 : si64, onnx_node_name = "Reshape_84"} : (tensor<8x768x14x14xf32>, tensor<3xi64>) -> tensor<8x768x196xf32>
    %183 = "onnx.Transpose"(%182) {onnx_node_name = "Transpose_85", perm = [0, 2, 1]} : (tensor<8x768x196xf32>) -> tensor<8x196x768xf32>
    %184 = "onnx.Concat"(%173, %183) {axis = 1 : si64, onnx_node_name = "Concat_101"} : (tensor<8x1x768xf32>, tensor<8x196x768xf32>) -> tensor<8x197x768xf32>
    %185 = "onnx.Add"(%184, %77) {onnx_node_name = "Add_102"} : (tensor<8x197x768xf32>, tensor<1x197x768xf32>) -> tensor<8x197x768xf32>
    %186 = "onnx.ReduceMean"(%185) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_103"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %187 = "onnx.Sub"(%185, %186) {onnx_node_name = "Sub_104"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %188 = "onnx.Pow"(%187, %0) {onnx_node_name = "Pow_106"} : (tensor<8x197x768xf32>, tensor<f32>) -> tensor<8x197x768xf32>
    %189 = "onnx.ReduceMean"(%188) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_107"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %190 = "onnx.Add"(%189, %165) {onnx_node_name = "Add_109"} : (tensor<8x197x1xf32>, tensor<f32>) -> tensor<8x197x1xf32>
    %191 = "onnx.Sqrt"(%190) {onnx_node_name = "Sqrt_110"} : (tensor<8x197x1xf32>) -> tensor<8x197x1xf32>
    %192 = "onnx.Div"(%187, %191) {onnx_node_name = "Div_111"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %193 = "onnx.Mul"(%192, %82) {onnx_node_name = "Mul_112"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %194 = "onnx.Add"(%193, %81) {onnx_node_name = "Add_113"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %195 = "onnx.Transpose"(%194) {onnx_node_name = "Transpose_114", perm = [1, 0, 2]} : (tensor<8x197x768xf32>) -> tensor<197x8x768xf32>
    %196 = "onnx.MatMul"(%195, %1) {onnx_node_name = "MatMul_128"} : (tensor<197x8x768xf32>, tensor<768x2304xf32>) -> tensor<197x8x2304xf32>
    %197 = "onnx.Add"(%196, %78) {onnx_node_name = "Add_129"} : (tensor<197x8x2304xf32>, tensor<2304xf32>) -> tensor<197x8x2304xf32>
    %198 = "onnx.Constant"() {value = dense<768> : tensor<3xi64>} : () -> tensor<3xi64>
    %199:3 = "onnx.Split"(%197, %198) {axis = 2 : si64} : (tensor<197x8x2304xf32>, tensor<3xi64>) -> (tensor<197x8x768xf32>, tensor<197x8x768xf32>, tensor<197x8x768xf32>)
    %200 = "onnx.Mul"(%199#0, %166) {onnx_node_name = "Mul_132"} : (tensor<197x8x768xf32>, tensor<f32>) -> tensor<197x8x768xf32>
    %201 = "onnx.Reshape"(%200, %174) {allowzero = 0 : si64, onnx_node_name = "Reshape_139"} : (tensor<197x8x768xf32>, tensor<3xi64>) -> tensor<197x96x64xf32>
    %202 = "onnx.Transpose"(%201) {onnx_node_name = "Transpose_140", perm = [1, 0, 2]} : (tensor<197x96x64xf32>) -> tensor<96x197x64xf32>
    %203 = "onnx.Reshape"(%199#1, %175) {allowzero = 0 : si64, onnx_node_name = "Reshape_146"} : (tensor<197x8x768xf32>, tensor<3xi64>) -> tensor<197x96x64xf32>
    %204 = "onnx.Reshape"(%199#2, %175) {allowzero = 0 : si64, onnx_node_name = "Reshape_152"} : (tensor<197x8x768xf32>, tensor<3xi64>) -> tensor<197x96x64xf32>
    %205 = "onnx.Transpose"(%204) {onnx_node_name = "Transpose_153", perm = [1, 0, 2]} : (tensor<197x96x64xf32>) -> tensor<96x197x64xf32>
    %206 = "onnx.Transpose"(%203) {onnx_node_name = "Transpose_154", perm = [1, 2, 0]} : (tensor<197x96x64xf32>) -> tensor<96x64x197xf32>
    %207 = "onnx.MatMul"(%202, %206) {onnx_node_name = "MatMul_155"} : (tensor<96x197x64xf32>, tensor<96x64x197xf32>) -> tensor<96x197x197xf32>
    %208 = "onnx.Softmax"(%207) {axis = 2 : si64, onnx_node_name = "Softmax_156", onnx_opset = 11 : si64} : (tensor<96x197x197xf32>) -> tensor<96x197x197xf32>
    %209 = "onnx.MatMul"(%208, %205) {onnx_node_name = "MatMul_157"} : (tensor<96x197x197xf32>, tensor<96x197x64xf32>) -> tensor<96x197x64xf32>
    %210 = "onnx.Transpose"(%209) {onnx_node_name = "Transpose_158", perm = [1, 0, 2]} : (tensor<96x197x64xf32>) -> tensor<197x96x64xf32>
    %211 = "onnx.Reshape"(%210, %176) {allowzero = 0 : si64, onnx_node_name = "Reshape_163"} : (tensor<197x96x64xf32>, tensor<3xi64>) -> tensor<197x8x768xf32>
    %212 = "onnx.MatMul"(%211, %2) {onnx_node_name = "MatMul_164"} : (tensor<197x8x768xf32>, tensor<768x768xf32>) -> tensor<197x8x768xf32>
    %213 = "onnx.Add"(%212, %79) {onnx_node_name = "Add_165"} : (tensor<197x8x768xf32>, tensor<768xf32>) -> tensor<197x8x768xf32>
    %214 = "onnx.Transpose"(%213) {onnx_node_name = "Transpose_166", perm = [1, 0, 2]} : (tensor<197x8x768xf32>) -> tensor<8x197x768xf32>
    %215 = "onnx.Add"(%184, %214) : (tensor<8x197x768xf32>, tensor<8x197x768xf32>) -> tensor<8x197x768xf32>
    %216 = "onnx.Add"(%215, %77) : (tensor<8x197x768xf32>, tensor<1x197x768xf32>) -> tensor<8x197x768xf32>
    %217 = "onnx.ReduceMean"(%216) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_168"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %218 = "onnx.Sub"(%216, %217) {onnx_node_name = "Sub_169"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %219 = "onnx.Pow"(%218, %3) {onnx_node_name = "Pow_171"} : (tensor<8x197x768xf32>, tensor<f32>) -> tensor<8x197x768xf32>
    %220 = "onnx.ReduceMean"(%219) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_172"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %221 = "onnx.Add"(%220, %165) {onnx_node_name = "Add_174"} : (tensor<8x197x1xf32>, tensor<f32>) -> tensor<8x197x1xf32>
    %222 = "onnx.Sqrt"(%221) {onnx_node_name = "Sqrt_175"} : (tensor<8x197x1xf32>) -> tensor<8x197x1xf32>
    %223 = "onnx.Div"(%218, %222) {onnx_node_name = "Div_176"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %224 = "onnx.Mul"(%223, %84) {onnx_node_name = "Mul_177"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %225 = "onnx.Add"(%224, %83) {onnx_node_name = "Add_178"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %226 = "onnx.MatMul"(%225, %4) {onnx_node_name = "MatMul_179"} : (tensor<8x197x768xf32>, tensor<768x3072xf32>) -> tensor<8x197x3072xf32>
    %227 = "onnx.Add"(%226, %80) {onnx_node_name = "Add_180"} : (tensor<8x197x3072xf32>, tensor<3072xf32>) -> tensor<8x197x3072xf32>
    %228 = "onnx.Div"(%227, %167) {onnx_node_name = "Div_182"} : (tensor<8x197x3072xf32>, tensor<f32>) -> tensor<8x197x3072xf32>
    %229 = "onnx.Erf"(%228) {onnx_node_name = "Erf_183"} : (tensor<8x197x3072xf32>) -> tensor<8x197x3072xf32>
    %230 = "onnx.Add"(%229, %168) {onnx_node_name = "Add_185"} : (tensor<8x197x3072xf32>, tensor<f32>) -> tensor<8x197x3072xf32>
    %231 = "onnx.Mul"(%227, %230) {onnx_node_name = "Mul_186"} : (tensor<8x197x3072xf32>, tensor<8x197x3072xf32>) -> tensor<8x197x3072xf32>
    %232 = "onnx.Mul"(%231, %169) {onnx_node_name = "Mul_188"} : (tensor<8x197x3072xf32>, tensor<f32>) -> tensor<8x197x3072xf32>
    %233 = "onnx.MatMul"(%232, %5) {onnx_node_name = "MatMul_189"} : (tensor<8x197x3072xf32>, tensor<3072x768xf32>) -> tensor<8x197x768xf32>
    %234 = "onnx.Add"(%215, %233) : (tensor<8x197x768xf32>, tensor<8x197x768xf32>) -> tensor<8x197x768xf32>
    %235 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x197x768xf32>} : () -> tensor<1x197x768xf32>
    %236 = "onnx.Add"(%234, %235) : (tensor<8x197x768xf32>, tensor<1x197x768xf32>) -> tensor<8x197x768xf32>
    %237 = "onnx.ReduceMean"(%236) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_192"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %238 = "onnx.Sub"(%236, %237) {onnx_node_name = "Sub_193"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %239 = "onnx.Pow"(%238, %6) {onnx_node_name = "Pow_195"} : (tensor<8x197x768xf32>, tensor<f32>) -> tensor<8x197x768xf32>
    %240 = "onnx.ReduceMean"(%239) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_196"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %241 = "onnx.Add"(%240, %165) {onnx_node_name = "Add_198"} : (tensor<8x197x1xf32>, tensor<f32>) -> tensor<8x197x1xf32>
    %242 = "onnx.Sqrt"(%241) {onnx_node_name = "Sqrt_199"} : (tensor<8x197x1xf32>) -> tensor<8x197x1xf32>
    %243 = "onnx.Div"(%238, %242) {onnx_node_name = "Div_200"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %244 = "onnx.Mul"(%243, %89) {onnx_node_name = "Mul_201"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %245 = "onnx.Add"(%244, %88) {onnx_node_name = "Add_202"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %246 = "onnx.Transpose"(%245) {onnx_node_name = "Transpose_203", perm = [1, 0, 2]} : (tensor<8x197x768xf32>) -> tensor<197x8x768xf32>
    %247 = "onnx.MatMul"(%246, %7) {onnx_node_name = "MatMul_217"} : (tensor<197x8x768xf32>, tensor<768x2304xf32>) -> tensor<197x8x2304xf32>
    %248 = "onnx.Add"(%247, %85) {onnx_node_name = "Add_218"} : (tensor<197x8x2304xf32>, tensor<2304xf32>) -> tensor<197x8x2304xf32>
    %249 = "onnx.Constant"() {value = dense<768> : tensor<3xi64>} : () -> tensor<3xi64>
    %250:3 = "onnx.Split"(%248, %249) {axis = 2 : si64} : (tensor<197x8x2304xf32>, tensor<3xi64>) -> (tensor<197x8x768xf32>, tensor<197x8x768xf32>, tensor<197x8x768xf32>)
    %251 = "onnx.Mul"(%250#0, %166) {onnx_node_name = "Mul_221"} : (tensor<197x8x768xf32>, tensor<f32>) -> tensor<197x8x768xf32>
    %252 = "onnx.Reshape"(%251, %174) {allowzero = 0 : si64, onnx_node_name = "Reshape_228"} : (tensor<197x8x768xf32>, tensor<3xi64>) -> tensor<197x96x64xf32>
    %253 = "onnx.Transpose"(%252) {onnx_node_name = "Transpose_229", perm = [1, 0, 2]} : (tensor<197x96x64xf32>) -> tensor<96x197x64xf32>
    %254 = "onnx.Reshape"(%250#1, %175) {allowzero = 0 : si64, onnx_node_name = "Reshape_235"} : (tensor<197x8x768xf32>, tensor<3xi64>) -> tensor<197x96x64xf32>
    %255 = "onnx.Reshape"(%250#2, %175) {allowzero = 0 : si64, onnx_node_name = "Reshape_241"} : (tensor<197x8x768xf32>, tensor<3xi64>) -> tensor<197x96x64xf32>
    %256 = "onnx.Transpose"(%255) {onnx_node_name = "Transpose_242", perm = [1, 0, 2]} : (tensor<197x96x64xf32>) -> tensor<96x197x64xf32>
    %257 = "onnx.Transpose"(%254) {onnx_node_name = "Transpose_243", perm = [1, 2, 0]} : (tensor<197x96x64xf32>) -> tensor<96x64x197xf32>
    %258 = "onnx.MatMul"(%253, %257) {onnx_node_name = "MatMul_244"} : (tensor<96x197x64xf32>, tensor<96x64x197xf32>) -> tensor<96x197x197xf32>
    %259 = "onnx.Softmax"(%258) {axis = 2 : si64, onnx_node_name = "Softmax_245", onnx_opset = 11 : si64} : (tensor<96x197x197xf32>) -> tensor<96x197x197xf32>
    %260 = "onnx.MatMul"(%259, %256) {onnx_node_name = "MatMul_246"} : (tensor<96x197x197xf32>, tensor<96x197x64xf32>) -> tensor<96x197x64xf32>
    %261 = "onnx.Transpose"(%260) {onnx_node_name = "Transpose_247", perm = [1, 0, 2]} : (tensor<96x197x64xf32>) -> tensor<197x96x64xf32>
    %262 = "onnx.Reshape"(%261, %176) {allowzero = 0 : si64, onnx_node_name = "Reshape_252"} : (tensor<197x96x64xf32>, tensor<3xi64>) -> tensor<197x8x768xf32>
    %263 = "onnx.MatMul"(%262, %8) {onnx_node_name = "MatMul_253"} : (tensor<197x8x768xf32>, tensor<768x768xf32>) -> tensor<197x8x768xf32>
    %264 = "onnx.Add"(%263, %86) {onnx_node_name = "Add_254"} : (tensor<197x8x768xf32>, tensor<768xf32>) -> tensor<197x8x768xf32>
    %265 = "onnx.Transpose"(%264) {onnx_node_name = "Transpose_255", perm = [1, 0, 2]} : (tensor<197x8x768xf32>) -> tensor<8x197x768xf32>
    %266 = "onnx.Add"(%234, %265) : (tensor<8x197x768xf32>, tensor<8x197x768xf32>) -> tensor<8x197x768xf32>
    %267 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x197x768xf32>} : () -> tensor<1x197x768xf32>
    %268 = "onnx.Add"(%266, %267) : (tensor<8x197x768xf32>, tensor<1x197x768xf32>) -> tensor<8x197x768xf32>
    %269 = "onnx.ReduceMean"(%268) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_257"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %270 = "onnx.Sub"(%268, %269) {onnx_node_name = "Sub_258"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %271 = "onnx.Pow"(%270, %9) {onnx_node_name = "Pow_260"} : (tensor<8x197x768xf32>, tensor<f32>) -> tensor<8x197x768xf32>
    %272 = "onnx.ReduceMean"(%271) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_261"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %273 = "onnx.Add"(%272, %165) {onnx_node_name = "Add_263"} : (tensor<8x197x1xf32>, tensor<f32>) -> tensor<8x197x1xf32>
    %274 = "onnx.Sqrt"(%273) {onnx_node_name = "Sqrt_264"} : (tensor<8x197x1xf32>) -> tensor<8x197x1xf32>
    %275 = "onnx.Div"(%270, %274) {onnx_node_name = "Div_265"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %276 = "onnx.Mul"(%275, %91) {onnx_node_name = "Mul_266"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %277 = "onnx.Add"(%276, %90) {onnx_node_name = "Add_267"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %278 = "onnx.MatMul"(%277, %10) {onnx_node_name = "MatMul_268"} : (tensor<8x197x768xf32>, tensor<768x3072xf32>) -> tensor<8x197x3072xf32>
    %279 = "onnx.Add"(%278, %87) {onnx_node_name = "Add_269"} : (tensor<8x197x3072xf32>, tensor<3072xf32>) -> tensor<8x197x3072xf32>
    %280 = "onnx.Div"(%279, %167) {onnx_node_name = "Div_271"} : (tensor<8x197x3072xf32>, tensor<f32>) -> tensor<8x197x3072xf32>
    %281 = "onnx.Erf"(%280) {onnx_node_name = "Erf_272"} : (tensor<8x197x3072xf32>) -> tensor<8x197x3072xf32>
    %282 = "onnx.Add"(%281, %168) {onnx_node_name = "Add_274"} : (tensor<8x197x3072xf32>, tensor<f32>) -> tensor<8x197x3072xf32>
    %283 = "onnx.Mul"(%279, %282) {onnx_node_name = "Mul_275"} : (tensor<8x197x3072xf32>, tensor<8x197x3072xf32>) -> tensor<8x197x3072xf32>
    %284 = "onnx.Mul"(%283, %169) {onnx_node_name = "Mul_277"} : (tensor<8x197x3072xf32>, tensor<f32>) -> tensor<8x197x3072xf32>
    %285 = "onnx.MatMul"(%284, %11) {onnx_node_name = "MatMul_278"} : (tensor<8x197x3072xf32>, tensor<3072x768xf32>) -> tensor<8x197x768xf32>
    %286 = "onnx.Add"(%266, %285) : (tensor<8x197x768xf32>, tensor<8x197x768xf32>) -> tensor<8x197x768xf32>
    %287 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x197x768xf32>} : () -> tensor<1x197x768xf32>
    %288 = "onnx.Add"(%286, %287) : (tensor<8x197x768xf32>, tensor<1x197x768xf32>) -> tensor<8x197x768xf32>
    %289 = "onnx.ReduceMean"(%288) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_281"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %290 = "onnx.Sub"(%288, %289) {onnx_node_name = "Sub_282"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %291 = "onnx.Pow"(%290, %12) {onnx_node_name = "Pow_284"} : (tensor<8x197x768xf32>, tensor<f32>) -> tensor<8x197x768xf32>
    %292 = "onnx.ReduceMean"(%291) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_285"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %293 = "onnx.Add"(%292, %165) {onnx_node_name = "Add_287"} : (tensor<8x197x1xf32>, tensor<f32>) -> tensor<8x197x1xf32>
    %294 = "onnx.Sqrt"(%293) {onnx_node_name = "Sqrt_288"} : (tensor<8x197x1xf32>) -> tensor<8x197x1xf32>
    %295 = "onnx.Div"(%290, %294) {onnx_node_name = "Div_289"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %296 = "onnx.Mul"(%295, %110) {onnx_node_name = "Mul_290"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %297 = "onnx.Add"(%296, %109) {onnx_node_name = "Add_291"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %298 = "onnx.Transpose"(%297) {onnx_node_name = "Transpose_292", perm = [1, 0, 2]} : (tensor<8x197x768xf32>) -> tensor<197x8x768xf32>
    %299 = "onnx.MatMul"(%298, %13) {onnx_node_name = "MatMul_306"} : (tensor<197x8x768xf32>, tensor<768x2304xf32>) -> tensor<197x8x2304xf32>
    %300 = "onnx.Add"(%299, %106) {onnx_node_name = "Add_307"} : (tensor<197x8x2304xf32>, tensor<2304xf32>) -> tensor<197x8x2304xf32>
    %301 = "onnx.Constant"() {value = dense<768> : tensor<3xi64>} : () -> tensor<3xi64>
    %302:3 = "onnx.Split"(%300, %301) {axis = 2 : si64} : (tensor<197x8x2304xf32>, tensor<3xi64>) -> (tensor<197x8x768xf32>, tensor<197x8x768xf32>, tensor<197x8x768xf32>)
    %303 = "onnx.Mul"(%302#0, %166) {onnx_node_name = "Mul_310"} : (tensor<197x8x768xf32>, tensor<f32>) -> tensor<197x8x768xf32>
    %304 = "onnx.Reshape"(%303, %174) {allowzero = 0 : si64, onnx_node_name = "Reshape_317"} : (tensor<197x8x768xf32>, tensor<3xi64>) -> tensor<197x96x64xf32>
    %305 = "onnx.Transpose"(%304) {onnx_node_name = "Transpose_318", perm = [1, 0, 2]} : (tensor<197x96x64xf32>) -> tensor<96x197x64xf32>
    %306 = "onnx.Reshape"(%302#1, %175) {allowzero = 0 : si64, onnx_node_name = "Reshape_324"} : (tensor<197x8x768xf32>, tensor<3xi64>) -> tensor<197x96x64xf32>
    %307 = "onnx.Reshape"(%302#2, %175) {allowzero = 0 : si64, onnx_node_name = "Reshape_330"} : (tensor<197x8x768xf32>, tensor<3xi64>) -> tensor<197x96x64xf32>
    %308 = "onnx.Transpose"(%307) {onnx_node_name = "Transpose_331", perm = [1, 0, 2]} : (tensor<197x96x64xf32>) -> tensor<96x197x64xf32>
    %309 = "onnx.Transpose"(%306) {onnx_node_name = "Transpose_332", perm = [1, 2, 0]} : (tensor<197x96x64xf32>) -> tensor<96x64x197xf32>
    %310 = "onnx.MatMul"(%305, %309) {onnx_node_name = "MatMul_333"} : (tensor<96x197x64xf32>, tensor<96x64x197xf32>) -> tensor<96x197x197xf32>
    %311 = "onnx.Softmax"(%310) {axis = 2 : si64, onnx_node_name = "Softmax_334", onnx_opset = 11 : si64} : (tensor<96x197x197xf32>) -> tensor<96x197x197xf32>
    %312 = "onnx.MatMul"(%311, %308) {onnx_node_name = "MatMul_335"} : (tensor<96x197x197xf32>, tensor<96x197x64xf32>) -> tensor<96x197x64xf32>
    %313 = "onnx.Transpose"(%312) {onnx_node_name = "Transpose_336", perm = [1, 0, 2]} : (tensor<96x197x64xf32>) -> tensor<197x96x64xf32>
    %314 = "onnx.Reshape"(%313, %176) {allowzero = 0 : si64, onnx_node_name = "Reshape_341"} : (tensor<197x96x64xf32>, tensor<3xi64>) -> tensor<197x8x768xf32>
    %315 = "onnx.MatMul"(%314, %14) {onnx_node_name = "MatMul_342"} : (tensor<197x8x768xf32>, tensor<768x768xf32>) -> tensor<197x8x768xf32>
    %316 = "onnx.Add"(%315, %107) {onnx_node_name = "Add_343"} : (tensor<197x8x768xf32>, tensor<768xf32>) -> tensor<197x8x768xf32>
    %317 = "onnx.Transpose"(%316) {onnx_node_name = "Transpose_344", perm = [1, 0, 2]} : (tensor<197x8x768xf32>) -> tensor<8x197x768xf32>
    %318 = "onnx.Add"(%286, %317) : (tensor<8x197x768xf32>, tensor<8x197x768xf32>) -> tensor<8x197x768xf32>
    %319 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x197x768xf32>} : () -> tensor<1x197x768xf32>
    %320 = "onnx.Add"(%318, %319) : (tensor<8x197x768xf32>, tensor<1x197x768xf32>) -> tensor<8x197x768xf32>
    %321 = "onnx.ReduceMean"(%320) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_346"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %322 = "onnx.Sub"(%320, %321) {onnx_node_name = "Sub_347"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %323 = "onnx.Pow"(%322, %15) {onnx_node_name = "Pow_349"} : (tensor<8x197x768xf32>, tensor<f32>) -> tensor<8x197x768xf32>
    %324 = "onnx.ReduceMean"(%323) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_350"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %325 = "onnx.Add"(%324, %165) {onnx_node_name = "Add_352"} : (tensor<8x197x1xf32>, tensor<f32>) -> tensor<8x197x1xf32>
    %326 = "onnx.Sqrt"(%325) {onnx_node_name = "Sqrt_353"} : (tensor<8x197x1xf32>) -> tensor<8x197x1xf32>
    %327 = "onnx.Div"(%322, %326) {onnx_node_name = "Div_354"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %328 = "onnx.Mul"(%327, %112) {onnx_node_name = "Mul_355"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %329 = "onnx.Add"(%328, %111) {onnx_node_name = "Add_356"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %330 = "onnx.MatMul"(%329, %16) {onnx_node_name = "MatMul_357"} : (tensor<8x197x768xf32>, tensor<768x3072xf32>) -> tensor<8x197x3072xf32>
    %331 = "onnx.Add"(%330, %108) {onnx_node_name = "Add_358"} : (tensor<8x197x3072xf32>, tensor<3072xf32>) -> tensor<8x197x3072xf32>
    %332 = "onnx.Div"(%331, %167) {onnx_node_name = "Div_360"} : (tensor<8x197x3072xf32>, tensor<f32>) -> tensor<8x197x3072xf32>
    %333 = "onnx.Erf"(%332) {onnx_node_name = "Erf_361"} : (tensor<8x197x3072xf32>) -> tensor<8x197x3072xf32>
    %334 = "onnx.Add"(%333, %168) {onnx_node_name = "Add_363"} : (tensor<8x197x3072xf32>, tensor<f32>) -> tensor<8x197x3072xf32>
    %335 = "onnx.Mul"(%331, %334) {onnx_node_name = "Mul_364"} : (tensor<8x197x3072xf32>, tensor<8x197x3072xf32>) -> tensor<8x197x3072xf32>
    %336 = "onnx.Mul"(%335, %169) {onnx_node_name = "Mul_366"} : (tensor<8x197x3072xf32>, tensor<f32>) -> tensor<8x197x3072xf32>
    %337 = "onnx.MatMul"(%336, %17) {onnx_node_name = "MatMul_367"} : (tensor<8x197x3072xf32>, tensor<3072x768xf32>) -> tensor<8x197x768xf32>
    %338 = "onnx.Add"(%318, %337) : (tensor<8x197x768xf32>, tensor<8x197x768xf32>) -> tensor<8x197x768xf32>
    %339 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x197x768xf32>} : () -> tensor<1x197x768xf32>
    %340 = "onnx.Add"(%338, %339) : (tensor<8x197x768xf32>, tensor<1x197x768xf32>) -> tensor<8x197x768xf32>
    %341 = "onnx.ReduceMean"(%340) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_370"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %342 = "onnx.Sub"(%340, %341) {onnx_node_name = "Sub_371"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %343 = "onnx.Pow"(%342, %18) {onnx_node_name = "Pow_373"} : (tensor<8x197x768xf32>, tensor<f32>) -> tensor<8x197x768xf32>
    %344 = "onnx.ReduceMean"(%343) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_374"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %345 = "onnx.Add"(%344, %165) {onnx_node_name = "Add_376"} : (tensor<8x197x1xf32>, tensor<f32>) -> tensor<8x197x1xf32>
    %346 = "onnx.Sqrt"(%345) {onnx_node_name = "Sqrt_377"} : (tensor<8x197x1xf32>) -> tensor<8x197x1xf32>
    %347 = "onnx.Div"(%342, %346) {onnx_node_name = "Div_378"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %348 = "onnx.Mul"(%347, %117) {onnx_node_name = "Mul_379"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %349 = "onnx.Add"(%348, %116) {onnx_node_name = "Add_380"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %350 = "onnx.Transpose"(%349) {onnx_node_name = "Transpose_381", perm = [1, 0, 2]} : (tensor<8x197x768xf32>) -> tensor<197x8x768xf32>
    %351 = "onnx.MatMul"(%350, %19) {onnx_node_name = "MatMul_395"} : (tensor<197x8x768xf32>, tensor<768x2304xf32>) -> tensor<197x8x2304xf32>
    %352 = "onnx.Add"(%351, %113) {onnx_node_name = "Add_396"} : (tensor<197x8x2304xf32>, tensor<2304xf32>) -> tensor<197x8x2304xf32>
    %353 = "onnx.Constant"() {value = dense<768> : tensor<3xi64>} : () -> tensor<3xi64>
    %354:3 = "onnx.Split"(%352, %353) {axis = 2 : si64} : (tensor<197x8x2304xf32>, tensor<3xi64>) -> (tensor<197x8x768xf32>, tensor<197x8x768xf32>, tensor<197x8x768xf32>)
    %355 = "onnx.Mul"(%354#0, %166) {onnx_node_name = "Mul_399"} : (tensor<197x8x768xf32>, tensor<f32>) -> tensor<197x8x768xf32>
    %356 = "onnx.Reshape"(%355, %174) {allowzero = 0 : si64, onnx_node_name = "Reshape_406"} : (tensor<197x8x768xf32>, tensor<3xi64>) -> tensor<197x96x64xf32>
    %357 = "onnx.Transpose"(%356) {onnx_node_name = "Transpose_407", perm = [1, 0, 2]} : (tensor<197x96x64xf32>) -> tensor<96x197x64xf32>
    %358 = "onnx.Reshape"(%354#1, %175) {allowzero = 0 : si64, onnx_node_name = "Reshape_413"} : (tensor<197x8x768xf32>, tensor<3xi64>) -> tensor<197x96x64xf32>
    %359 = "onnx.Reshape"(%354#2, %175) {allowzero = 0 : si64, onnx_node_name = "Reshape_419"} : (tensor<197x8x768xf32>, tensor<3xi64>) -> tensor<197x96x64xf32>
    %360 = "onnx.Transpose"(%359) {onnx_node_name = "Transpose_420", perm = [1, 0, 2]} : (tensor<197x96x64xf32>) -> tensor<96x197x64xf32>
    %361 = "onnx.Transpose"(%358) {onnx_node_name = "Transpose_421", perm = [1, 2, 0]} : (tensor<197x96x64xf32>) -> tensor<96x64x197xf32>
    %362 = "onnx.MatMul"(%357, %361) {onnx_node_name = "MatMul_422"} : (tensor<96x197x64xf32>, tensor<96x64x197xf32>) -> tensor<96x197x197xf32>
    %363 = "onnx.Softmax"(%362) {axis = 2 : si64, onnx_node_name = "Softmax_423", onnx_opset = 11 : si64} : (tensor<96x197x197xf32>) -> tensor<96x197x197xf32>
    %364 = "onnx.MatMul"(%363, %360) {onnx_node_name = "MatMul_424"} : (tensor<96x197x197xf32>, tensor<96x197x64xf32>) -> tensor<96x197x64xf32>
    %365 = "onnx.Transpose"(%364) {onnx_node_name = "Transpose_425", perm = [1, 0, 2]} : (tensor<96x197x64xf32>) -> tensor<197x96x64xf32>
    %366 = "onnx.Reshape"(%365, %176) {allowzero = 0 : si64, onnx_node_name = "Reshape_430"} : (tensor<197x96x64xf32>, tensor<3xi64>) -> tensor<197x8x768xf32>
    %367 = "onnx.MatMul"(%366, %20) {onnx_node_name = "MatMul_431"} : (tensor<197x8x768xf32>, tensor<768x768xf32>) -> tensor<197x8x768xf32>
    %368 = "onnx.Add"(%367, %114) {onnx_node_name = "Add_432"} : (tensor<197x8x768xf32>, tensor<768xf32>) -> tensor<197x8x768xf32>
    %369 = "onnx.Transpose"(%368) {onnx_node_name = "Transpose_433", perm = [1, 0, 2]} : (tensor<197x8x768xf32>) -> tensor<8x197x768xf32>
    %370 = "onnx.Add"(%338, %369) : (tensor<8x197x768xf32>, tensor<8x197x768xf32>) -> tensor<8x197x768xf32>
    %371 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x197x768xf32>} : () -> tensor<1x197x768xf32>
    %372 = "onnx.Add"(%370, %371) : (tensor<8x197x768xf32>, tensor<1x197x768xf32>) -> tensor<8x197x768xf32>
    %373 = "onnx.ReduceMean"(%372) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_435"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %374 = "onnx.Sub"(%372, %373) {onnx_node_name = "Sub_436"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %375 = "onnx.Pow"(%374, %21) {onnx_node_name = "Pow_438"} : (tensor<8x197x768xf32>, tensor<f32>) -> tensor<8x197x768xf32>
    %376 = "onnx.ReduceMean"(%375) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_439"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %377 = "onnx.Add"(%376, %165) {onnx_node_name = "Add_441"} : (tensor<8x197x1xf32>, tensor<f32>) -> tensor<8x197x1xf32>
    %378 = "onnx.Sqrt"(%377) {onnx_node_name = "Sqrt_442"} : (tensor<8x197x1xf32>) -> tensor<8x197x1xf32>
    %379 = "onnx.Div"(%374, %378) {onnx_node_name = "Div_443"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %380 = "onnx.Mul"(%379, %119) {onnx_node_name = "Mul_444"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %381 = "onnx.Add"(%380, %118) {onnx_node_name = "Add_445"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %382 = "onnx.MatMul"(%381, %22) {onnx_node_name = "MatMul_446"} : (tensor<8x197x768xf32>, tensor<768x3072xf32>) -> tensor<8x197x3072xf32>
    %383 = "onnx.Add"(%382, %115) {onnx_node_name = "Add_447"} : (tensor<8x197x3072xf32>, tensor<3072xf32>) -> tensor<8x197x3072xf32>
    %384 = "onnx.Div"(%383, %167) {onnx_node_name = "Div_449"} : (tensor<8x197x3072xf32>, tensor<f32>) -> tensor<8x197x3072xf32>
    %385 = "onnx.Erf"(%384) {onnx_node_name = "Erf_450"} : (tensor<8x197x3072xf32>) -> tensor<8x197x3072xf32>
    %386 = "onnx.Add"(%385, %168) {onnx_node_name = "Add_452"} : (tensor<8x197x3072xf32>, tensor<f32>) -> tensor<8x197x3072xf32>
    %387 = "onnx.Mul"(%383, %386) {onnx_node_name = "Mul_453"} : (tensor<8x197x3072xf32>, tensor<8x197x3072xf32>) -> tensor<8x197x3072xf32>
    %388 = "onnx.Mul"(%387, %169) {onnx_node_name = "Mul_455"} : (tensor<8x197x3072xf32>, tensor<f32>) -> tensor<8x197x3072xf32>
    %389 = "onnx.MatMul"(%388, %23) {onnx_node_name = "MatMul_456"} : (tensor<8x197x3072xf32>, tensor<3072x768xf32>) -> tensor<8x197x768xf32>
    %390 = "onnx.Add"(%370, %389) : (tensor<8x197x768xf32>, tensor<8x197x768xf32>) -> tensor<8x197x768xf32>
    %391 = "onnx.Constant"() {value = dense_resource<__elided__> : tensor<1x197x768xf32>} : () -> tensor<1x197x768xf32>
    %392 = "onnx.Add"(%390, %391) : (tensor<8x197x768xf32>, tensor<1x197x768xf32>) -> tensor<8x197x768xf32>
    %393 = "onnx.ReduceMean"(%392) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_459"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %394 = "onnx.Sub"(%392, %393) {onnx_node_name = "Sub_460"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %395 = "onnx.Pow"(%394, %24) {onnx_node_name = "Pow_462"} : (tensor<8x197x768xf32>, tensor<f32>) -> tensor<8x197x768xf32>
    %396 = "onnx.ReduceMean"(%395) {axes = [-1], keepdims = 1 : si64, onnx_node_name = "ReduceMean_463"} : (tensor<8x197x768xf32>) -> tensor<8x197x1xf32>
    %397 = "onnx.Add"(%396, %165) {onnx_node_name = "Add_465"} : (tensor<8x197x1xf32>, tensor<f32>) -> tensor<8x197x1xf32>
    %398 = "onnx.Sqrt"(%397) {onnx_node_name = "Sqrt_466"} : (tensor<8x197x1xf32>) -> tensor<8x197x1xf32>
    %399 = "onnx.Div"(%394, %398) {onnx_node_name = "Div_467"} : (tensor<8x197x768xf32>, tensor<8x197x1xf32>) -> tensor<8x197x768xf32>
    %400 = "onnx.Mul"(%399, %124) {onnx_node_name = "Mul_468"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %401 = "onnx.Add"(%400, %123) {onnx_node_name = "Add_469"} : (tensor<8x197x768xf32>, tensor<768xf32>) -> tensor<8x197x768xf32>
    %402 = "onnx.Transpose"(%401) {onnx_node_name = "Transpose_470", perm = [1, 0, 2]} : (tensor<8x197x768xf32>) -> tensor<197x8x768xf32>
    %403 = "onnx.MatMul"(%402, %25) {onnx_node_name = "MatMul_484"} : (tensor<197x8x768xf32>, tensor<768x2304xf32>) -> tensor<197x8x2304xf32>
